espressif/esp32-nesemu/components/driver/localinclude/soc/rmt_ctrl_reg.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#ifndef _DRIVER_RMT_CTRL_REG_H_
#define _DRIVER_RMT_CTRL_REG_H_

//#define REG_RMT_BASE (0x60016000)//Tony Copy from old rmt reg.h
#include "soc.h"
#define RMT_CH0DATA_REG          (DR_REG_RMT_BASE + 0x0000)
#define RMT_CH1DATA_REG          (DR_REG_RMT_BASE + 0x0004)
#define RMT_CH2DATA_REG          (DR_REG_RMT_BASE + 0x0008)
#define RMT_CH3DATA_REG          (DR_REG_RMT_BASE + 0x000c)
#define RMT_CH4DATA_REG          (DR_REG_RMT_BASE + 0x0010)
#define RMT_CH5DATA_REG          (DR_REG_RMT_BASE + 0x0014)
#define RMT_CH6DATA_REG          (DR_REG_RMT_BASE + 0x0018)
#define RMT_CH7DATA_REG          (DR_REG_RMT_BASE + 0x001c)

#define RMT_CH0CONF0_REG          (DR_REG_RMT_BASE + 0x0020)
    /* RMT_CLK_EN : R/W ;bitpos:[31] ;default: 1'h0 ; */
    /*description: */
    #define RMT_CLK_EN  (BIT(31))
    #define RMT_CLK_EN_M  (BIT(31))
    #define RMT_CLK_EN_V  0x1
    #define RMT_CLK_EN_S  31
    /* RMT_MEM_PD : R/W ;bitpos:[30] ;default: 1'b0 ; */
    /*description: */
    #define RMT_MEM_PD  (BIT(30))
    #define RMT_MEM_PD_M  (BIT(30))
    #define RMT_MEM_PD_V  0x1
    #define RMT_MEM_PD_S  30
    /* RMT_CARRIER_OUT_LV_CH0 : R/W ;bitpos:[29] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_OUT_LV_CH0  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH0_M  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH0_V  0x1
    #define RMT_CARRIER_OUT_LV_CH0_S  29
    /* RMT_CARRIER_EN_CH0 : R/W ;bitpos:[28] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_EN_CH0  (BIT(28))
    #define RMT_CARRIER_EN_CH0_M  (BIT(28))
    #define RMT_CARRIER_EN_CH0_V  0x1
    #define RMT_CARRIER_EN_CH0_S  28
    /* RMT_MEM_SIZE_CH0 : R/W ;bitpos:[27:24] ;default: 4'h1 ; */
    /*description: */
    #define RMT_MEM_SIZE_CH0  0x0000000F
    #define RMT_MEM_SIZE_CH0_M  ((RMT_MEM_SIZE_CH0_V)<<(RMT_MEM_SIZE_CH0_S))
    #define RMT_MEM_SIZE_CH0_V  0xF
    #define RMT_MEM_SIZE_CH0_S  24
    /* RMT_IDLE_THRES_CH0 : R/W ;bitpos:[23:8] ;default: 16'h1000 ; */
    /*description: */
    #define RMT_IDLE_THRES_CH0  0x0000FFFF
    #define RMT_IDLE_THRES_CH0_M  ((RMT_IDLE_THRES_CH0_V)<<(RMT_IDLE_THRES_CH0_S))
    #define RMT_IDLE_THRES_CH0_V  0xFFFF
    #define RMT_IDLE_THRES_CH0_S  8
    /* RMT_DIV_CNT_CH0 : R/W ;bitpos:[7:0] ;default: 8'h2 ; */
    /*description: */
    #define RMT_DIV_CNT_CH0  0x000000FF
    #define RMT_DIV_CNT_CH0_M  ((RMT_DIV_CNT_CH0_V)<<(RMT_DIV_CNT_CH0_S))
    #define RMT_DIV_CNT_CH0_V  0xFF
    #define RMT_DIV_CNT_CH0_S  0



#define RMT_CH0CONF1_REG          (DR_REG_RMT_BASE + 0x0024)
    /* RMT_IDLE_OUT_EN_CH0 : R/W ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_EN_CH0  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH0_M  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH0_V  0x1
    #define RMT_IDLE_OUT_EN_CH0_S  19
    /* RMT_IDLE_OUT_LV_CH0 : R/W ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_LV_CH0  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH0_M  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH0_V  0x1
    #define RMT_IDLE_OUT_LV_CH0_S  18
    /* RMT_REF_ALWAYS_ON_CH0 : R/W ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_ALWAYS_ON_CH0  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH0_M  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH0_V  0x1
    #define RMT_REF_ALWAYS_ON_CH0_S  17
    /* RMT_REF_CNT_RST_CH0 : R/W ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_CNT_RST_CH0  (BIT(16))
    #define RMT_REF_CNT_RST_CH0_M  (BIT(16))
    #define RMT_REF_CNT_RST_CH0_V  0x1
    #define RMT_REF_CNT_RST_CH0_S  16
    /* RMT_RX_FILTER_THRES_CH0 : R/W ;bitpos:[15:8] ;default: 8'hf ; */
    /*description: */
    #define RMT_RX_FILTER_THRES_CH0  0x000000FF
    #define RMT_RX_FILTER_THRES_CH0_M  ((RMT_RX_FILTER_THRES_CH0_V)<<(RMT_RX_FILTER_THRES_CH0_S))
    #define RMT_RX_FILTER_THRES_CH0_V  0xFF
    #define RMT_RX_FILTER_THRES_CH0_S  8
    /* RMT_RX_FILTER_EN_CH0 : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_RX_FILTER_EN_CH0  (BIT(7))
    #define RMT_RX_FILTER_EN_CH0_M  (BIT(7))
    #define RMT_RX_FILTER_EN_CH0_V  0x1
    #define RMT_RX_FILTER_EN_CH0_S  7
    /* RMT_TX_CONTI_MODE_CH0 : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_TX_CONTI_MODE_CH0  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH0_M  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH0_V  0x1
    #define RMT_TX_CONTI_MODE_CH0_S  6
    /* RMT_MEM_OWNER_CH0 : R/W ;bitpos:[5] ;default: 1'b1 ; */
    /*description: */
    #define RMT_MEM_OWNER_CH0  (BIT(5))
    #define RMT_MEM_OWNER_CH0_M  (BIT(5))
    #define RMT_MEM_OWNER_CH0_V  0x1
    #define RMT_MEM_OWNER_CH0_S  5
    /* RMT_APB_MEM_RST_CH0 : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_APB_MEM_RST_CH0  (BIT(4))
    #define RMT_APB_MEM_RST_CH0_M  (BIT(4))
    #define RMT_APB_MEM_RST_CH0_V  0x1
    #define RMT_APB_MEM_RST_CH0_S  4
    /* RMT_MEM_RD_RST_CH0 : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_MEM_RD_RST_CH0  (BIT(3))
    #define RMT_MEM_RD_RST_CH0_M  (BIT(3))
    #define RMT_MEM_RD_RST_CH0_V  0x1
    #define RMT_MEM_RD_RST_CH0_S  3
    /* RMT_MEM_WR_RST_CH0 : R/W ;bitpos:[2] ;default: 1'h0 ; */
    /*description: */
    #define RMT_MEM_WR_RST_CH0  (BIT(2))
    #define RMT_MEM_WR_RST_CH0_M  (BIT(2))
    #define RMT_MEM_WR_RST_CH0_V  0x1
    #define RMT_MEM_WR_RST_CH0_S  2
    /* RMT_RX_EN_CH0 : R/W ;bitpos:[1] ;default: 1'h0 ; */
    /*description: */
    #define RMT_RX_EN_CH0  (BIT(1))
    #define RMT_RX_EN_CH0_M  (BIT(1))
    #define RMT_RX_EN_CH0_V  0x1
    #define RMT_RX_EN_CH0_S  1
    /* RMT_TX_START_CH0 : R/W ;bitpos:[0] ;default: 1'h0 ; */
    /*description: */
    #define RMT_TX_START_CH0  (BIT(0))
    #define RMT_TX_START_CH0_M  (BIT(0))
    #define RMT_TX_START_CH0_V  0x1
    #define RMT_TX_START_CH0_S  0



