espressif/esp32-nesemu/components/driver/localinclude/soc/rmt_ctrl_reg.h
#define RMT_CH1CONF0_REG          (DR_REG_RMT_BASE + 0x0028)
    /* RMT_CARRIER_OUT_LV_CH1 : R/W ;bitpos:[29] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_OUT_LV_CH1  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH1_M  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH1_V  0x1
    #define RMT_CARRIER_OUT_LV_CH1_S  29
    /* RMT_CARRIER_EN_CH1 : R/W ;bitpos:[28] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_EN_CH1  (BIT(28))
    #define RMT_CARRIER_EN_CH1_M  (BIT(28))
    #define RMT_CARRIER_EN_CH1_V  0x1
    #define RMT_CARRIER_EN_CH1_S  28
    /* RMT_MEM_SIZE_CH1 : R/W ;bitpos:[27:24] ;default: 4'h1 ; */
    /*description: */
    #define RMT_MEM_SIZE_CH1  0x0000000F
    #define RMT_MEM_SIZE_CH1_M  ((RMT_MEM_SIZE_CH1_V)<<(RMT_MEM_SIZE_CH1_S))
    #define RMT_MEM_SIZE_CH1_V  0xF
    #define RMT_MEM_SIZE_CH1_S  24
    /* RMT_IDLE_THRES_CH1 : R/W ;bitpos:[23:8] ;default: 16'h1000 ; */
    /*description: */
    #define RMT_IDLE_THRES_CH1  0x0000FFFF
    #define RMT_IDLE_THRES_CH1_M  ((RMT_IDLE_THRES_CH1_V)<<(RMT_IDLE_THRES_CH1_S))
    #define RMT_IDLE_THRES_CH1_V  0xFFFF
    #define RMT_IDLE_THRES_CH1_S  8
    /* RMT_DIV_CNT_CH1 : R/W ;bitpos:[7:0] ;default: 8'h2 ; */
    /*description: */
    #define RMT_DIV_CNT_CH1  0x000000FF
    #define RMT_DIV_CNT_CH1_M  ((RMT_DIV_CNT_CH1_V)<<(RMT_DIV_CNT_CH1_S))
    #define RMT_DIV_CNT_CH1_V  0xFF
    #define RMT_DIV_CNT_CH1_S  0



#define RMT_CH1CONF1_REG          (DR_REG_RMT_BASE + 0x002c)
    /* RMT_IDLE_OUT_EN_CH1 : R/W ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_EN_CH1  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH1_M  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH1_V  0x1
    #define RMT_IDLE_OUT_EN_CH1_S  19
    /* RMT_IDLE_OUT_LV_CH1 : R/W ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_LV_CH1  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH1_M  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH1_V  0x1
    #define RMT_IDLE_OUT_LV_CH1_S  18
    /* RMT_REF_ALWAYS_ON_CH1 : R/W ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_ALWAYS_ON_CH1  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH1_M  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH1_V  0x1
    #define RMT_REF_ALWAYS_ON_CH1_S  17
    /* RMT_REF_CNT_RST_CH1 : R/W ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_CNT_RST_CH1  (BIT(16))
    #define RMT_REF_CNT_RST_CH1_M  (BIT(16))
    #define RMT_REF_CNT_RST_CH1_V  0x1
    #define RMT_REF_CNT_RST_CH1_S  16
    /* RMT_RX_FILTER_THRES_CH1 : R/W ;bitpos:[15:8] ;default: 8'hf ; */
    /*description: */
    #define RMT_RX_FILTER_THRES_CH1  0x000000FF
    #define RMT_RX_FILTER_THRES_CH1_M  ((RMT_RX_FILTER_THRES_CH1_V)<<(RMT_RX_FILTER_THRES_CH1_S))
    #define RMT_RX_FILTER_THRES_CH1_V  0xFF
    #define RMT_RX_FILTER_THRES_CH1_S  8
    /* RMT_RX_FILTER_EN_CH1 : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_RX_FILTER_EN_CH1  (BIT(7))
    #define RMT_RX_FILTER_EN_CH1_M  (BIT(7))
    #define RMT_RX_FILTER_EN_CH1_V  0x1
    #define RMT_RX_FILTER_EN_CH1_S  7
    /* RMT_TX_CONTI_MODE_CH1 : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_TX_CONTI_MODE_CH1  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH1_M  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH1_V  0x1
    #define RMT_TX_CONTI_MODE_CH1_S  6
    /* RMT_MEM_OWNER_CH1 : R/W ;bitpos:[5] ;default: 1'b1 ; */
    /*description: */
    #define RMT_MEM_OWNER_CH1  (BIT(5))
    #define RMT_MEM_OWNER_CH1_M  (BIT(5))
    #define RMT_MEM_OWNER_CH1_V  0x1
    #define RMT_MEM_OWNER_CH1_S  5
    /* RMT_APB_MEM_RST_CH1 : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_APB_MEM_RST_CH1  (BIT(4))
    #define RMT_APB_MEM_RST_CH1_M  (BIT(4))
    #define RMT_APB_MEM_RST_CH1_V  0x1
    #define RMT_APB_MEM_RST_CH1_S  4
    /* RMT_MEM_RD_RST_CH1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_MEM_RD_RST_CH1  (BIT(3))
    #define RMT_MEM_RD_RST_CH1_M  (BIT(3))
    #define RMT_MEM_RD_RST_CH1_V  0x1
    #define RMT_MEM_RD_RST_CH1_S  3
    /* RMT_MEM_WR_RST_CH1 : R/W ;bitpos:[2] ;default: 1'h0 ; */
    /*description: */
    #define RMT_MEM_WR_RST_CH1  (BIT(2))
    #define RMT_MEM_WR_RST_CH1_M  (BIT(2))
    #define RMT_MEM_WR_RST_CH1_V  0x1
    #define RMT_MEM_WR_RST_CH1_S  2
    /* RMT_RX_EN_CH1 : R/W ;bitpos:[1] ;default: 1'h0 ; */
    /*description: */
    #define RMT_RX_EN_CH1  (BIT(1))
    #define RMT_RX_EN_CH1_M  (BIT(1))
    #define RMT_RX_EN_CH1_V  0x1
    #define RMT_RX_EN_CH1_S  1
    /* RMT_TX_START_CH1 : R/W ;bitpos:[0] ;default: 1'h0 ; */
    /*description: */
    #define RMT_TX_START_CH1  (BIT(0))
    #define RMT_TX_START_CH1_M  (BIT(0))
    #define RMT_TX_START_CH1_V  0x1
    #define RMT_TX_START_CH1_S  0



#define RMT_CH2CONF0_REG          (DR_REG_RMT_BASE + 0x0030)
    /* RMT_CARRIER_OUT_LV_CH2 : R/W ;bitpos:[29] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_OUT_LV_CH2  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH2_M  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH2_V  0x1
    #define RMT_CARRIER_OUT_LV_CH2_S  29
    /* RMT_CARRIER_EN_CH2 : R/W ;bitpos:[28] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_EN_CH2  (BIT(28))
    #define RMT_CARRIER_EN_CH2_M  (BIT(28))
    #define RMT_CARRIER_EN_CH2_V  0x1
    #define RMT_CARRIER_EN_CH2_S  28
    /* RMT_MEM_SIZE_CH2 : R/W ;bitpos:[27:24] ;default: 4'h1 ; */
    /*description: */
    #define RMT_MEM_SIZE_CH2  0x0000000F
    #define RMT_MEM_SIZE_CH2_M  ((RMT_MEM_SIZE_CH2_V)<<(RMT_MEM_SIZE_CH2_S))
    #define RMT_MEM_SIZE_CH2_V  0xF
    #define RMT_MEM_SIZE_CH2_S  24
    /* RMT_IDLE_THRES_CH2 : R/W ;bitpos:[23:8] ;default: 16'h1000 ; */
    /*description: */
    #define RMT_IDLE_THRES_CH2  0x0000FFFF
    #define RMT_IDLE_THRES_CH2_M  ((RMT_IDLE_THRES_CH2_V)<<(RMT_IDLE_THRES_CH2_S))
    #define RMT_IDLE_THRES_CH2_V  0xFFFF
    #define RMT_IDLE_THRES_CH2_S  8
    /* RMT_DIV_CNT_CH2 : R/W ;bitpos:[7:0] ;default: 8'h2 ; */
    /*description: */
    #define RMT_DIV_CNT_CH2  0x000000FF
    #define RMT_DIV_CNT_CH2_M  ((RMT_DIV_CNT_CH2_V)<<(RMT_DIV_CNT_CH2_S))
    #define RMT_DIV_CNT_CH2_V  0xFF
    #define RMT_DIV_CNT_CH2_S  0



#define RMT_CH2CONF1_REG          (DR_REG_RMT_BASE + 0x0034)
    /* RMT_IDLE_OUT_EN_CH2 : R/W ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_EN_CH2  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH2_M  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH2_V  0x1
    #define RMT_IDLE_OUT_EN_CH2_S  19
    /* RMT_IDLE_OUT_LV_CH2 : R/W ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_LV_CH2  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH2_M  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH2_V  0x1
    #define RMT_IDLE_OUT_LV_CH2_S  18
    /* RMT_REF_ALWAYS_ON_CH2 : R/W ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_ALWAYS_ON_CH2  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH2_M  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH2_V  0x1
    #define RMT_REF_ALWAYS_ON_CH2_S  17
    /* RMT_REF_CNT_RST_CH2 : R/W ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_CNT_RST_CH2  (BIT(16))
    #define RMT_REF_CNT_RST_CH2_M  (BIT(16))
    #define RMT_REF_CNT_RST_CH2_V  0x1
    #define RMT_REF_CNT_RST_CH2_S  16
    /* RMT_RX_FILTER_THRES_CH2 : R/W ;bitpos:[15:8] ;default: 8'hf ; */
    /*description: */
    #define RMT_RX_FILTER_THRES_CH2  0x000000FF
    #define RMT_RX_FILTER_THRES_CH2_M  ((RMT_RX_FILTER_THRES_CH2_V)<<(RMT_RX_FILTER_THRES_CH2_S))
    #define RMT_RX_FILTER_THRES_CH2_V  0xFF
    #define RMT_RX_FILTER_THRES_CH2_S  8
    /* RMT_RX_FILTER_EN_CH2 : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_RX_FILTER_EN_CH2  (BIT(7))
    #define RMT_RX_FILTER_EN_CH2_M  (BIT(7))
    #define RMT_RX_FILTER_EN_CH2_V  0x1
    #define RMT_RX_FILTER_EN_CH2_S  7
    /* RMT_TX_CONTI_MODE_CH2 : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_TX_CONTI_MODE_CH2  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH2_M  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH2_V  0x1
    #define RMT_TX_CONTI_MODE_CH2_S  6
    /* RMT_MEM_OWNER_CH2 : R/W ;bitpos:[5] ;default: 1'b1 ; */
    /*description: */
    #define RMT_MEM_OWNER_CH2  (BIT(5))
    #define RMT_MEM_OWNER_CH2_M  (BIT(5))
    #define RMT_MEM_OWNER_CH2_V  0x1
    #define RMT_MEM_OWNER_CH2_S  5
    /* RMT_APB_MEM_RST_CH2 : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_APB_MEM_RST_CH2  (BIT(4))
    #define RMT_APB_MEM_RST_CH2_M  (BIT(4))
    #define RMT_APB_MEM_RST_CH2_V  0x1
    #define RMT_APB_MEM_RST_CH2_S  4
    /* RMT_MEM_RD_RST_CH2 : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_MEM_RD_RST_CH2  (BIT(3))
    #define RMT_MEM_RD_RST_CH2_M  (BIT(3))
    #define RMT_MEM_RD_RST_CH2_V  0x1
    #define RMT_MEM_RD_RST_CH2_S  3
    /* RMT_MEM_WR_RST_CH2 : R/W ;bitpos:[2] ;default: 1'h0 ; */
    /*description: */
    #define RMT_MEM_WR_RST_CH2  (BIT(2))
    #define RMT_MEM_WR_RST_CH2_M  (BIT(2))
    #define RMT_MEM_WR_RST_CH2_V  0x1
    #define RMT_MEM_WR_RST_CH2_S  2
    /* RMT_RX_EN_CH2 : R/W ;bitpos:[1] ;default: 1'h0 ; */
    /*description: */
    #define RMT_RX_EN_CH2  (BIT(1))
    #define RMT_RX_EN_CH2_M  (BIT(1))
    #define RMT_RX_EN_CH2_V  0x1
    #define RMT_RX_EN_CH2_S  1
    /* RMT_TX_START_CH2 : R/W ;bitpos:[0] ;default: 1'h0 ; */
    /*description: */
    #define RMT_TX_START_CH2  (BIT(0))
    #define RMT_TX_START_CH2_M  (BIT(0))
    #define RMT_TX_START_CH2_V  0x1
    #define RMT_TX_START_CH2_S  0



#define RMT_CH3CONF0_REG          (DR_REG_RMT_BASE + 0x0038)
    /* RMT_CARRIER_OUT_LV_CH3 : R/W ;bitpos:[29] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_OUT_LV_CH3  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH3_M  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH3_V  0x1
    #define RMT_CARRIER_OUT_LV_CH3_S  29
    /* RMT_CARRIER_EN_CH3 : R/W ;bitpos:[28] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_EN_CH3  (BIT(28))
    #define RMT_CARRIER_EN_CH3_M  (BIT(28))
    #define RMT_CARRIER_EN_CH3_V  0x1
    #define RMT_CARRIER_EN_CH3_S  28
    /* RMT_MEM_SIZE_CH3 : R/W ;bitpos:[27:24] ;default: 4'h1 ; */
    /*description: */
    #define RMT_MEM_SIZE_CH3  0x0000000F
    #define RMT_MEM_SIZE_CH3_M  ((RMT_MEM_SIZE_CH3_V)<<(RMT_MEM_SIZE_CH3_S))
    #define RMT_MEM_SIZE_CH3_V  0xF
    #define RMT_MEM_SIZE_CH3_S  24
    /* RMT_IDLE_THRES_CH3 : R/W ;bitpos:[23:8] ;default: 16'h1000 ; */
    /*description: */
    #define RMT_IDLE_THRES_CH3  0x0000FFFF
    #define RMT_IDLE_THRES_CH3_M  ((RMT_IDLE_THRES_CH3_V)<<(RMT_IDLE_THRES_CH3_S))
    #define RMT_IDLE_THRES_CH3_V  0xFFFF
    #define RMT_IDLE_THRES_CH3_S  8
    /* RMT_DIV_CNT_CH3 : R/W ;bitpos:[7:0] ;default: 8'h2 ; */
    /*description: */
    #define RMT_DIV_CNT_CH3  0x000000FF
    #define RMT_DIV_CNT_CH3_M  ((RMT_DIV_CNT_CH3_V)<<(RMT_DIV_CNT_CH3_S))
    #define RMT_DIV_CNT_CH3_V  0xFF
    #define RMT_DIV_CNT_CH3_S  0



#define RMT_CH3CONF1_REG          (DR_REG_RMT_BASE + 0x003c)
    /* RMT_IDLE_OUT_EN_CH3 : R/W ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_EN_CH3  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH3_M  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH3_V  0x1
    #define RMT_IDLE_OUT_EN_CH3_S  19
    /* RMT_IDLE_OUT_LV_CH3 : R/W ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_LV_CH3  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH3_M  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH3_V  0x1
    #define RMT_IDLE_OUT_LV_CH3_S  18
    /* RMT_REF_ALWAYS_ON_CH3 : R/W ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_ALWAYS_ON_CH3  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH3_M  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH3_V  0x1
    #define RMT_REF_ALWAYS_ON_CH3_S  17
    /* RMT_REF_CNT_RST_CH3 : R/W ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_CNT_RST_CH3  (BIT(16))
    #define RMT_REF_CNT_RST_CH3_M  (BIT(16))
    #define RMT_REF_CNT_RST_CH3_V  0x1
    #define RMT_REF_CNT_RST_CH3_S  16
    /* RMT_RX_FILTER_THRES_CH3 : R/W ;bitpos:[15:8] ;default: 8'hf ; */
    /*description: */
    #define RMT_RX_FILTER_THRES_CH3  0x000000FF
    #define RMT_RX_FILTER_THRES_CH3_M  ((RMT_RX_FILTER_THRES_CH3_V)<<(RMT_RX_FILTER_THRES_CH3_S))
    #define RMT_RX_FILTER_THRES_CH3_V  0xFF
    #define RMT_RX_FILTER_THRES_CH3_S  8
    /* RMT_RX_FILTER_EN_CH3 : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_RX_FILTER_EN_CH3  (BIT(7))
    #define RMT_RX_FILTER_EN_CH3_M  (BIT(7))
    #define RMT_RX_FILTER_EN_CH3_V  0x1
    #define RMT_RX_FILTER_EN_CH3_S  7
    /* RMT_TX_CONTI_MODE_CH3 : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_TX_CONTI_MODE_CH3  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH3_M  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH3_V  0x1
    #define RMT_TX_CONTI_MODE_CH3_S  6
    /* RMT_MEM_OWNER_CH3 : R/W ;bitpos:[5] ;default: 1'b1 ; */
    /*description: */
    #define RMT_MEM_OWNER_CH3  (BIT(5))
    #define RMT_MEM_OWNER_CH3_M  (BIT(5))
    #define RMT_MEM_OWNER_CH3_V  0x1
    #define RMT_MEM_OWNER_CH3_S  5
    /* RMT_APB_MEM_RST_CH3 : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_APB_MEM_RST_CH3  (BIT(4))
    #define RMT_APB_MEM_RST_CH3_M  (BIT(4))
    #define RMT_APB_MEM_RST_CH3_V  0x1
    #define RMT_APB_MEM_RST_CH3_S  4
    /* RMT_MEM_RD_RST_CH3 : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_MEM_RD_RST_CH3  (BIT(3))
    #define RMT_MEM_RD_RST_CH3_M  (BIT(3))
    #define RMT_MEM_RD_RST_CH3_V  0x1
    #define RMT_MEM_RD_RST_CH3_S  3
    /* RMT_MEM_WR_RST_CH3 : R/W ;bitpos:[2] ;default: 1'h0 ; */
    /*description: */
    #define RMT_MEM_WR_RST_CH3  (BIT(2))
    #define RMT_MEM_WR_RST_CH3_M  (BIT(2))
    #define RMT_MEM_WR_RST_CH3_V  0x1
    #define RMT_MEM_WR_RST_CH3_S  2
    /* RMT_RX_EN_CH3 : R/W ;bitpos:[1] ;default: 1'h0 ; */
    /*description: */
    #define RMT_RX_EN_CH3  (BIT(1))
    #define RMT_RX_EN_CH3_M  (BIT(1))
    #define RMT_RX_EN_CH3_V  0x1
    #define RMT_RX_EN_CH3_S  1
    /* RMT_TX_START_CH3 : R/W ;bitpos:[0] ;default: 1'h0 ; */
    /*description: */
    #define RMT_TX_START_CH3  (BIT(0))
    #define RMT_TX_START_CH3_M  (BIT(0))
    #define RMT_TX_START_CH3_V  0x1
    #define RMT_TX_START_CH3_S  0



