espressif/esp32-nesemu/components/driver/localinclude/soc/rmt_ctrl_reg.h
#define RMT_CH6CONF1_REG          (DR_REG_RMT_BASE + 0x0054)
    /* RMT_IDLE_OUT_EN_CH6 : R/W ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_EN_CH6  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH6_M  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH6_V  0x1
    #define RMT_IDLE_OUT_EN_CH6_S  19
    /* RMT_IDLE_OUT_LV_CH6 : R/W ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_LV_CH6  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH6_M  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH6_V  0x1
    #define RMT_IDLE_OUT_LV_CH6_S  18
    /* RMT_REF_ALWAYS_ON_CH6 : R/W ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_ALWAYS_ON_CH6  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH6_M  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH6_V  0x1
    #define RMT_REF_ALWAYS_ON_CH6_S  17
    /* RMT_REF_CNT_RST_CH6 : R/W ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_CNT_RST_CH6  (BIT(16))
    #define RMT_REF_CNT_RST_CH6_M  (BIT(16))
    #define RMT_REF_CNT_RST_CH6_V  0x1
    #define RMT_REF_CNT_RST_CH6_S  16
    /* RMT_RX_FILTER_THRES_CH6 : R/W ;bitpos:[15:8] ;default: 8'hf ; */
    /*description: */
    #define RMT_RX_FILTER_THRES_CH6  0x000000FF
    #define RMT_RX_FILTER_THRES_CH6_M  ((RMT_RX_FILTER_THRES_CH6_V)<<(RMT_RX_FILTER_THRES_CH6_S))
    #define RMT_RX_FILTER_THRES_CH6_V  0xFF
    #define RMT_RX_FILTER_THRES_CH6_S  8
    /* RMT_RX_FILTER_EN_CH6 : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_RX_FILTER_EN_CH6  (BIT(7))
    #define RMT_RX_FILTER_EN_CH6_M  (BIT(7))
    #define RMT_RX_FILTER_EN_CH6_V  0x1
    #define RMT_RX_FILTER_EN_CH6_S  7
    /* RMT_TX_CONTI_MODE_CH6 : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_TX_CONTI_MODE_CH6  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH6_M  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH6_V  0x1
    #define RMT_TX_CONTI_MODE_CH6_S  6
    /* RMT_MEM_OWNER_CH6 : R/W ;bitpos:[5] ;default: 1'b1 ; */
    /*description: */
    #define RMT_MEM_OWNER_CH6  (BIT(5))
    #define RMT_MEM_OWNER_CH6_M  (BIT(5))
    #define RMT_MEM_OWNER_CH6_V  0x1
    #define RMT_MEM_OWNER_CH6_S  5
    /* RMT_APB_MEM_RST_CH6 : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_APB_MEM_RST_CH6  (BIT(4))
    #define RMT_APB_MEM_RST_CH6_M  (BIT(4))
    #define RMT_APB_MEM_RST_CH6_V  0x1
    #define RMT_APB_MEM_RST_CH6_S  4
    /* RMT_MEM_RD_RST_CH6 : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_MEM_RD_RST_CH6  (BIT(3))
    #define RMT_MEM_RD_RST_CH6_M  (BIT(3))
    #define RMT_MEM_RD_RST_CH6_V  0x1
    #define RMT_MEM_RD_RST_CH6_S  3
    /* RMT_MEM_WR_RST_CH6 : R/W ;bitpos:[2] ;default: 1'h0 ; */
    /*description: */
    #define RMT_MEM_WR_RST_CH6  (BIT(2))
    #define RMT_MEM_WR_RST_CH6_M  (BIT(2))
    #define RMT_MEM_WR_RST_CH6_V  0x1
    #define RMT_MEM_WR_RST_CH6_S  2
    /* RMT_RX_EN_CH6 : R/W ;bitpos:[1] ;default: 1'h0 ; */
    /*description: */
    #define RMT_RX_EN_CH6  (BIT(1))
    #define RMT_RX_EN_CH6_M  (BIT(1))
    #define RMT_RX_EN_CH6_V  0x1
    #define RMT_RX_EN_CH6_S  1
    /* RMT_TX_START_CH6 : R/W ;bitpos:[0] ;default: 1'h0 ; */
    /*description: */
    #define RMT_TX_START_CH6  (BIT(0))
    #define RMT_TX_START_CH6_M  (BIT(0))
    #define RMT_TX_START_CH6_V  0x1
    #define RMT_TX_START_CH6_S  0



#define RMT_CH7CONF0_REG          (DR_REG_RMT_BASE + 0x0058)
    /* RMT_CARRIER_OUT_LV_CH7 : R/W ;bitpos:[29] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_OUT_LV_CH7  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH7_M  (BIT(29))
    #define RMT_CARRIER_OUT_LV_CH7_V  0x1
    #define RMT_CARRIER_OUT_LV_CH7_S  29
    /* RMT_CARRIER_EN_CH7 : R/W ;bitpos:[28] ;default: 1'b1 ; */
    /*description: */
    #define RMT_CARRIER_EN_CH7  (BIT(28))
    #define RMT_CARRIER_EN_CH7_M  (BIT(28))
    #define RMT_CARRIER_EN_CH7_V  0x1
    #define RMT_CARRIER_EN_CH7_S  28
    /* RMT_MEM_SIZE_CH7 : R/W ;bitpos:[27:24] ;default: 4'h1 ; */
    /*description: */
    #define RMT_MEM_SIZE_CH7  0x0000000F
    #define RMT_MEM_SIZE_CH7_M  ((RMT_MEM_SIZE_CH7_V)<<(RMT_MEM_SIZE_CH7_S))
    #define RMT_MEM_SIZE_CH7_V  0xF
    #define RMT_MEM_SIZE_CH7_S  24
    /* RMT_IDLE_THRES_CH7 : R/W ;bitpos:[23:8] ;default: 16'h1000 ; */
    /*description: */
    #define RMT_IDLE_THRES_CH7  0x0000FFFF
    #define RMT_IDLE_THRES_CH7_M  ((RMT_IDLE_THRES_CH7_V)<<(RMT_IDLE_THRES_CH7_S))
    #define RMT_IDLE_THRES_CH7_V  0xFFFF
    #define RMT_IDLE_THRES_CH7_S  8
    /* RMT_DIV_CNT_CH7 : R/W ;bitpos:[7:0] ;default: 8'h2 ; */
    /*description: */
    #define RMT_DIV_CNT_CH7  0x000000FF
    #define RMT_DIV_CNT_CH7_M  ((RMT_DIV_CNT_CH7_V)<<(RMT_DIV_CNT_CH7_S))
    #define RMT_DIV_CNT_CH7_V  0xFF
    #define RMT_DIV_CNT_CH7_S  0



#define RMT_CH7CONF1_REG          (DR_REG_RMT_BASE + 0x005c)
    /* RMT_IDLE_OUT_EN_CH7 : R/W ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_EN_CH7  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH7_M  (BIT(19))
    #define RMT_IDLE_OUT_EN_CH7_V  0x1
    #define RMT_IDLE_OUT_EN_CH7_S  19
    /* RMT_IDLE_OUT_LV_CH7 : R/W ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_IDLE_OUT_LV_CH7  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH7_M  (BIT(18))
    #define RMT_IDLE_OUT_LV_CH7_V  0x1
    #define RMT_IDLE_OUT_LV_CH7_S  18
    /* RMT_REF_ALWAYS_ON_CH7 : R/W ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_ALWAYS_ON_CH7  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH7_M  (BIT(17))
    #define RMT_REF_ALWAYS_ON_CH7_V  0x1
    #define RMT_REF_ALWAYS_ON_CH7_S  17
    /* RMT_REF_CNT_RST_CH7 : R/W ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_REF_CNT_RST_CH7  (BIT(16))
    #define RMT_REF_CNT_RST_CH7_M  (BIT(16))
    #define RMT_REF_CNT_RST_CH7_V  0x1
    #define RMT_REF_CNT_RST_CH7_S  16
    /* RMT_RX_FILTER_THRES_CH7 : R/W ;bitpos:[15:8] ;default: 8'hf ; */
    /*description: */
    #define RMT_RX_FILTER_THRES_CH7  0x000000FF
    #define RMT_RX_FILTER_THRES_CH7_M  ((RMT_RX_FILTER_THRES_CH7_V)<<(RMT_RX_FILTER_THRES_CH7_S))
    #define RMT_RX_FILTER_THRES_CH7_V  0xFF
    #define RMT_RX_FILTER_THRES_CH7_S  8
    /* RMT_RX_FILTER_EN_CH7 : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_RX_FILTER_EN_CH7  (BIT(7))
    #define RMT_RX_FILTER_EN_CH7_M  (BIT(7))
    #define RMT_RX_FILTER_EN_CH7_V  0x1
    #define RMT_RX_FILTER_EN_CH7_S  7
    /* RMT_TX_CONTI_MODE_CH7 : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_TX_CONTI_MODE_CH7  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH7_M  (BIT(6))
    #define RMT_TX_CONTI_MODE_CH7_V  0x1
    #define RMT_TX_CONTI_MODE_CH7_S  6
    /* RMT_MEM_OWNER_CH7 : R/W ;bitpos:[5] ;default: 1'b1 ; */
    /*description: */
    #define RMT_MEM_OWNER_CH7  (BIT(5))
    #define RMT_MEM_OWNER_CH7_M  (BIT(5))
    #define RMT_MEM_OWNER_CH7_V  0x1
    #define RMT_MEM_OWNER_CH7_S  5
    /* RMT_APB_MEM_RST_CH7 : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_APB_MEM_RST_CH7  (BIT(4))
    #define RMT_APB_MEM_RST_CH7_M  (BIT(4))
    #define RMT_APB_MEM_RST_CH7_V  0x1
    #define RMT_APB_MEM_RST_CH7_S  4
    /* RMT_MEM_RD_RST_CH7 : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_MEM_RD_RST_CH7  (BIT(3))
    #define RMT_MEM_RD_RST_CH7_M  (BIT(3))
    #define RMT_MEM_RD_RST_CH7_V  0x1
    #define RMT_MEM_RD_RST_CH7_S  3
    /* RMT_MEM_WR_RST_CH7 : R/W ;bitpos:[2] ;default: 1'h0 ; */
    /*description: */
    #define RMT_MEM_WR_RST_CH7  (BIT(2))
    #define RMT_MEM_WR_RST_CH7_M  (BIT(2))
    #define RMT_MEM_WR_RST_CH7_V  0x1
    #define RMT_MEM_WR_RST_CH7_S  2
    /* RMT_RX_EN_CH7 : R/W ;bitpos:[1] ;default: 1'h0 ; */
    /*description: */
    #define RMT_RX_EN_CH7  (BIT(1))
    #define RMT_RX_EN_CH7_M  (BIT(1))
    #define RMT_RX_EN_CH7_V  0x1
    #define RMT_RX_EN_CH7_S  1
    /* RMT_TX_START_CH7 : R/W ;bitpos:[0] ;default: 1'h0 ; */
    /*description: */
    #define RMT_TX_START_CH7  (BIT(0))
    #define RMT_TX_START_CH7_M  (BIT(0))
    #define RMT_TX_START_CH7_V  0x1
    #define RMT_TX_START_CH7_S  0



#define RMT_CH0STATUS_REG          (DR_REG_RMT_BASE + 0x0060)
    /* RMT_STATUS_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_STATUS_CH0  0xFFFFFFFF
    #define RMT_STATUS_CH0_M  ((RMT_STATUS_CH0_V)<<(RMT_STATUS_CH0_S))
    #define RMT_STATUS_CH0_V  0xFFFFFFFF
    #define RMT_STATUS_CH0_S  0



#define RMT_CH1STATUS_REG          (DR_REG_RMT_BASE + 0x0064)
    /* RMT_STATUS_CH1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_STATUS_CH1  0xFFFFFFFF
    #define RMT_STATUS_CH1_M  ((RMT_STATUS_CH1_V)<<(RMT_STATUS_CH1_S))
    #define RMT_STATUS_CH1_V  0xFFFFFFFF
    #define RMT_STATUS_CH1_S  0



