espressif/esp32-nesemu/components/driver/localinclude/soc/rmt_ctrl_reg.h
#define RMT_CH2STATUS_REG          (DR_REG_RMT_BASE + 0x0068)
    /* RMT_STATUS_CH2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_STATUS_CH2  0xFFFFFFFF
    #define RMT_STATUS_CH2_M  ((RMT_STATUS_CH2_V)<<(RMT_STATUS_CH2_S))
    #define RMT_STATUS_CH2_V  0xFFFFFFFF
    #define RMT_STATUS_CH2_S  0



#define RMT_CH3STATUS_REG          (DR_REG_RMT_BASE + 0x006c)
    /* RMT_STATUS_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_STATUS_CH3  0xFFFFFFFF
    #define RMT_STATUS_CH3_M  ((RMT_STATUS_CH3_V)<<(RMT_STATUS_CH3_S))
    #define RMT_STATUS_CH3_V  0xFFFFFFFF
    #define RMT_STATUS_CH3_S  0



#define RMT_CH4STATUS_REG          (DR_REG_RMT_BASE + 0x0070)
    /* RMT_STATUS_CH4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_STATUS_CH4  0xFFFFFFFF
    #define RMT_STATUS_CH4_M  ((RMT_STATUS_CH4_V)<<(RMT_STATUS_CH4_S))
    #define RMT_STATUS_CH4_V  0xFFFFFFFF
    #define RMT_STATUS_CH4_S  0



#define RMT_CH5STATUS_REG          (DR_REG_RMT_BASE + 0x0074)
    /* RMT_STATUS_CH5 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_STATUS_CH5  0xFFFFFFFF
    #define RMT_STATUS_CH5_M  ((RMT_STATUS_CH5_V)<<(RMT_STATUS_CH5_S))
    #define RMT_STATUS_CH5_V  0xFFFFFFFF
    #define RMT_STATUS_CH5_S  0



#define RMT_CH6STATUS_REG          (DR_REG_RMT_BASE + 0x0078)
    /* RMT_STATUS_CH6 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_STATUS_CH6  0xFFFFFFFF
    #define RMT_STATUS_CH6_M  ((RMT_STATUS_CH6_V)<<(RMT_STATUS_CH6_S))
    #define RMT_STATUS_CH6_V  0xFFFFFFFF
    #define RMT_STATUS_CH6_S  0



#define RMT_CH7STATUS_REG          (DR_REG_RMT_BASE + 0x007c)
    /* RMT_STATUS_CH7 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_STATUS_CH7  0xFFFFFFFF
    #define RMT_STATUS_CH7_M  ((RMT_STATUS_CH7_V)<<(RMT_STATUS_CH7_S))
    #define RMT_STATUS_CH7_V  0xFFFFFFFF
    #define RMT_STATUS_CH7_S  0



#define RMT_CH0ADDR_REG          (DR_REG_RMT_BASE + 0x0080)
    /* RMT_APB_MEM_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_APB_MEM_ADDR_CH0  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH0_M  ((RMT_APB_MEM_ADDR_CH0_V)<<(RMT_APB_MEM_ADDR_CH0_S))
    #define RMT_APB_MEM_ADDR_CH0_V  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH0_S  0



#define RMT_CH1ADDR_REG          (DR_REG_RMT_BASE + 0x0084)
    /* RMT_APB_MEM_ADDR_CH1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_APB_MEM_ADDR_CH1  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH1_M  ((RMT_APB_MEM_ADDR_CH1_V)<<(RMT_APB_MEM_ADDR_CH1_S))
    #define RMT_APB_MEM_ADDR_CH1_V  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH1_S  0



#define RMT_CH2ADDR_REG          (DR_REG_RMT_BASE + 0x0088)
    /* RMT_APB_MEM_ADDR_CH2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_APB_MEM_ADDR_CH2  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH2_M  ((RMT_APB_MEM_ADDR_CH2_V)<<(RMT_APB_MEM_ADDR_CH2_S))
    #define RMT_APB_MEM_ADDR_CH2_V  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH2_S  0



#define RMT_CH3ADDR_REG          (DR_REG_RMT_BASE + 0x008c)
    /* RMT_APB_MEM_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_APB_MEM_ADDR_CH3  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH3_M  ((RMT_APB_MEM_ADDR_CH3_V)<<(RMT_APB_MEM_ADDR_CH3_S))
    #define RMT_APB_MEM_ADDR_CH3_V  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH3_S  0



#define RMT_CH4ADDR_REG          (DR_REG_RMT_BASE + 0x0090)
    /* RMT_APB_MEM_ADDR_CH4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_APB_MEM_ADDR_CH4  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH4_M  ((RMT_APB_MEM_ADDR_CH4_V)<<(RMT_APB_MEM_ADDR_CH4_S))
    #define RMT_APB_MEM_ADDR_CH4_V  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH4_S  0



#define RMT_CH5ADDR_REG          (DR_REG_RMT_BASE + 0x0094)
    /* RMT_APB_MEM_ADDR_CH5 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_APB_MEM_ADDR_CH5  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH5_M  ((RMT_APB_MEM_ADDR_CH5_V)<<(RMT_APB_MEM_ADDR_CH5_S))
    #define RMT_APB_MEM_ADDR_CH5_V  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH5_S  0



#define RMT_CH6ADDR_REG          (DR_REG_RMT_BASE + 0x0098)
    /* RMT_APB_MEM_ADDR_CH6 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_APB_MEM_ADDR_CH6  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH6_M  ((RMT_APB_MEM_ADDR_CH6_V)<<(RMT_APB_MEM_ADDR_CH6_S))
    #define RMT_APB_MEM_ADDR_CH6_V  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH6_S  0



#define RMT_CH7ADDR_REG          (DR_REG_RMT_BASE + 0x009c)
    /* RMT_APB_MEM_ADDR_CH7 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
    /*description: */
    #define RMT_APB_MEM_ADDR_CH7  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH7_M  ((RMT_APB_MEM_ADDR_CH7_V)<<(RMT_APB_MEM_ADDR_CH7_S))
    #define RMT_APB_MEM_ADDR_CH7_V  0xFFFFFFFF
    #define RMT_APB_MEM_ADDR_CH7_S  0



#define RMT_INT_RAW_REG          (DR_REG_RMT_BASE + 0x00a0)
    /* RMT_CH7_TX_THR_EVENT_INT_RAW : RO ;bitpos:[31] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_TX_THR_EVENT_INT_RAW  (BIT(31))
    #define RMT_CH7_TX_THR_EVENT_INT_RAW_M  (BIT(31))
    #define RMT_CH7_TX_THR_EVENT_INT_RAW_V  0x1
    #define RMT_CH7_TX_THR_EVENT_INT_RAW_S  31
    /* RMT_CH6_TX_THR_EVENT_INT_RAW : RO ;bitpos:[30] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_TX_THR_EVENT_INT_RAW  (BIT(30))
    #define RMT_CH6_TX_THR_EVENT_INT_RAW_M  (BIT(30))
    #define RMT_CH6_TX_THR_EVENT_INT_RAW_V  0x1
    #define RMT_CH6_TX_THR_EVENT_INT_RAW_S  30
    /* RMT_CH5_TX_THR_EVENT_INT_RAW : RO ;bitpos:[29] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_TX_THR_EVENT_INT_RAW  (BIT(29))
    #define RMT_CH5_TX_THR_EVENT_INT_RAW_M  (BIT(29))
    #define RMT_CH5_TX_THR_EVENT_INT_RAW_V  0x1
    #define RMT_CH5_TX_THR_EVENT_INT_RAW_S  29
    /* RMT_CH4_TX_THR_EVENT_INT_RAW : RO ;bitpos:[28] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_TX_THR_EVENT_INT_RAW  (BIT(28))
    #define RMT_CH4_TX_THR_EVENT_INT_RAW_M  (BIT(28))
    #define RMT_CH4_TX_THR_EVENT_INT_RAW_V  0x1
    #define RMT_CH4_TX_THR_EVENT_INT_RAW_S  28
    /* RMT_CH3_TX_THR_EVENT_INT_RAW : RO ;bitpos:[27] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_TX_THR_EVENT_INT_RAW  (BIT(27))
    #define RMT_CH3_TX_THR_EVENT_INT_RAW_M  (BIT(27))
    #define RMT_CH3_TX_THR_EVENT_INT_RAW_V  0x1
    #define RMT_CH3_TX_THR_EVENT_INT_RAW_S  27
    /* RMT_CH2_TX_THR_EVENT_INT_RAW : RO ;bitpos:[26] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_TX_THR_EVENT_INT_RAW  (BIT(26))
    #define RMT_CH2_TX_THR_EVENT_INT_RAW_M  (BIT(26))
    #define RMT_CH2_TX_THR_EVENT_INT_RAW_V  0x1
    #define RMT_CH2_TX_THR_EVENT_INT_RAW_S  26
    /* RMT_CH1_TX_THR_EVENT_INT_RAW : RO ;bitpos:[25] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_TX_THR_EVENT_INT_RAW  (BIT(25))
    #define RMT_CH1_TX_THR_EVENT_INT_RAW_M  (BIT(25))
    #define RMT_CH1_TX_THR_EVENT_INT_RAW_V  0x1
    #define RMT_CH1_TX_THR_EVENT_INT_RAW_S  25
    /* RMT_CH0_TX_THR_EVENT_INT_RAW : RO ;bitpos:[24] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_TX_THR_EVENT_INT_RAW  (BIT(24))
    #define RMT_CH0_TX_THR_EVENT_INT_RAW_M  (BIT(24))
    #define RMT_CH0_TX_THR_EVENT_INT_RAW_V  0x1
    #define RMT_CH0_TX_THR_EVENT_INT_RAW_S  24
    /* RMT_CH7_ERR_INT_RAW : RO ;bitpos:[23] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_ERR_INT_RAW  (BIT(23))
    #define RMT_CH7_ERR_INT_RAW_M  (BIT(23))
    #define RMT_CH7_ERR_INT_RAW_V  0x1
    #define RMT_CH7_ERR_INT_RAW_S  23
    /* RMT_CH7_RX_END_INT_RAW : RO ;bitpos:[22] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_RX_END_INT_RAW  (BIT(22))
    #define RMT_CH7_RX_END_INT_RAW_M  (BIT(22))
    #define RMT_CH7_RX_END_INT_RAW_V  0x1
    #define RMT_CH7_RX_END_INT_RAW_S  22
    /* RMT_CH7_TX_END_INT_RAW : RO ;bitpos:[21] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_TX_END_INT_RAW  (BIT(21))
    #define RMT_CH7_TX_END_INT_RAW_M  (BIT(21))
    #define RMT_CH7_TX_END_INT_RAW_V  0x1
    #define RMT_CH7_TX_END_INT_RAW_S  21
    /* RMT_CH6_ERR_INT_RAW : RO ;bitpos:[20] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_ERR_INT_RAW  (BIT(20))
    #define RMT_CH6_ERR_INT_RAW_M  (BIT(20))
    #define RMT_CH6_ERR_INT_RAW_V  0x1
    #define RMT_CH6_ERR_INT_RAW_S  20
    /* RMT_CH6_RX_END_INT_RAW : RO ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_RX_END_INT_RAW  (BIT(19))
    #define RMT_CH6_RX_END_INT_RAW_M  (BIT(19))
    #define RMT_CH6_RX_END_INT_RAW_V  0x1
    #define RMT_CH6_RX_END_INT_RAW_S  19
    /* RMT_CH6_TX_END_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_TX_END_INT_RAW  (BIT(18))
    #define RMT_CH6_TX_END_INT_RAW_M  (BIT(18))
    #define RMT_CH6_TX_END_INT_RAW_V  0x1
    #define RMT_CH6_TX_END_INT_RAW_S  18
    /* RMT_CH5_ERR_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_ERR_INT_RAW  (BIT(17))
    #define RMT_CH5_ERR_INT_RAW_M  (BIT(17))
    #define RMT_CH5_ERR_INT_RAW_V  0x1
    #define RMT_CH5_ERR_INT_RAW_S  17
    /* RMT_CH5_RX_END_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_RX_END_INT_RAW  (BIT(16))
    #define RMT_CH5_RX_END_INT_RAW_M  (BIT(16))
    #define RMT_CH5_RX_END_INT_RAW_V  0x1
    #define RMT_CH5_RX_END_INT_RAW_S  16
    /* RMT_CH5_TX_END_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_TX_END_INT_RAW  (BIT(15))
    #define RMT_CH5_TX_END_INT_RAW_M  (BIT(15))
    #define RMT_CH5_TX_END_INT_RAW_V  0x1
    #define RMT_CH5_TX_END_INT_RAW_S  15
    /* RMT_CH4_ERR_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_ERR_INT_RAW  (BIT(14))
    #define RMT_CH4_ERR_INT_RAW_M  (BIT(14))
    #define RMT_CH4_ERR_INT_RAW_V  0x1
    #define RMT_CH4_ERR_INT_RAW_S  14
    /* RMT_CH4_RX_END_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_RX_END_INT_RAW  (BIT(13))
    #define RMT_CH4_RX_END_INT_RAW_M  (BIT(13))
    #define RMT_CH4_RX_END_INT_RAW_V  0x1
    #define RMT_CH4_RX_END_INT_RAW_S  13
    /* RMT_CH4_TX_END_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_TX_END_INT_RAW  (BIT(12))
    #define RMT_CH4_TX_END_INT_RAW_M  (BIT(12))
    #define RMT_CH4_TX_END_INT_RAW_V  0x1
    #define RMT_CH4_TX_END_INT_RAW_S  12
    /* RMT_CH3_ERR_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_ERR_INT_RAW  (BIT(11))
    #define RMT_CH3_ERR_INT_RAW_M  (BIT(11))
    #define RMT_CH3_ERR_INT_RAW_V  0x1
    #define RMT_CH3_ERR_INT_RAW_S  11
    /* RMT_CH3_RX_END_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_RX_END_INT_RAW  (BIT(10))
    #define RMT_CH3_RX_END_INT_RAW_M  (BIT(10))
    #define RMT_CH3_RX_END_INT_RAW_V  0x1
    #define RMT_CH3_RX_END_INT_RAW_S  10
    /* RMT_CH3_TX_END_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_TX_END_INT_RAW  (BIT(9))
    #define RMT_CH3_TX_END_INT_RAW_M  (BIT(9))
    #define RMT_CH3_TX_END_INT_RAW_V  0x1
    #define RMT_CH3_TX_END_INT_RAW_S  9
    /* RMT_CH2_ERR_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_ERR_INT_RAW  (BIT(8))
    #define RMT_CH2_ERR_INT_RAW_M  (BIT(8))
    #define RMT_CH2_ERR_INT_RAW_V  0x1
    #define RMT_CH2_ERR_INT_RAW_S  8
    /* RMT_CH2_RX_END_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_RX_END_INT_RAW  (BIT(7))
    #define RMT_CH2_RX_END_INT_RAW_M  (BIT(7))
    #define RMT_CH2_RX_END_INT_RAW_V  0x1
    #define RMT_CH2_RX_END_INT_RAW_S  7
    /* RMT_CH2_TX_END_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_TX_END_INT_RAW  (BIT(6))
    #define RMT_CH2_TX_END_INT_RAW_M  (BIT(6))
    #define RMT_CH2_TX_END_INT_RAW_V  0x1
    #define RMT_CH2_TX_END_INT_RAW_S  6
    /* RMT_CH1_ERR_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_ERR_INT_RAW  (BIT(5))
    #define RMT_CH1_ERR_INT_RAW_M  (BIT(5))
    #define RMT_CH1_ERR_INT_RAW_V  0x1
    #define RMT_CH1_ERR_INT_RAW_S  5
    /* RMT_CH1_RX_END_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_RX_END_INT_RAW  (BIT(4))
    #define RMT_CH1_RX_END_INT_RAW_M  (BIT(4))
    #define RMT_CH1_RX_END_INT_RAW_V  0x1
    #define RMT_CH1_RX_END_INT_RAW_S  4
    /* RMT_CH1_TX_END_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_TX_END_INT_RAW  (BIT(3))
    #define RMT_CH1_TX_END_INT_RAW_M  (BIT(3))
    #define RMT_CH1_TX_END_INT_RAW_V  0x1
    #define RMT_CH1_TX_END_INT_RAW_S  3
    /* RMT_CH0_ERR_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_ERR_INT_RAW  (BIT(2))
    #define RMT_CH0_ERR_INT_RAW_M  (BIT(2))
    #define RMT_CH0_ERR_INT_RAW_V  0x1
    #define RMT_CH0_ERR_INT_RAW_S  2
    /* RMT_CH0_RX_END_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_RX_END_INT_RAW  (BIT(1))
    #define RMT_CH0_RX_END_INT_RAW_M  (BIT(1))
    #define RMT_CH0_RX_END_INT_RAW_V  0x1
    #define RMT_CH0_RX_END_INT_RAW_S  1
    /* RMT_CH0_TX_END_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_TX_END_INT_RAW  (BIT(0))
    #define RMT_CH0_TX_END_INT_RAW_M  (BIT(0))
    #define RMT_CH0_TX_END_INT_RAW_V  0x1
    #define RMT_CH0_TX_END_INT_RAW_S  0



