espressif/esp32-nesemu/components/driver/localinclude/soc/rmt_ctrl_reg.h
#define RMT_INT_ST_REG          (DR_REG_RMT_BASE + 0x00a4)
    /* RMT_CH7_TX_THR_EVENT_INT_ST : RO ;bitpos:[31] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_TX_THR_EVENT_INT_ST  (BIT(31))
    #define RMT_CH7_TX_THR_EVENT_INT_ST_M  (BIT(31))
    #define RMT_CH7_TX_THR_EVENT_INT_ST_V  0x1
    #define RMT_CH7_TX_THR_EVENT_INT_ST_S  31
    /* RMT_CH6_TX_THR_EVENT_INT_ST : RO ;bitpos:[30] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_TX_THR_EVENT_INT_ST  (BIT(30))
    #define RMT_CH6_TX_THR_EVENT_INT_ST_M  (BIT(30))
    #define RMT_CH6_TX_THR_EVENT_INT_ST_V  0x1
    #define RMT_CH6_TX_THR_EVENT_INT_ST_S  30
    /* RMT_CH5_TX_THR_EVENT_INT_ST : RO ;bitpos:[29] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_TX_THR_EVENT_INT_ST  (BIT(29))
    #define RMT_CH5_TX_THR_EVENT_INT_ST_M  (BIT(29))
    #define RMT_CH5_TX_THR_EVENT_INT_ST_V  0x1
    #define RMT_CH5_TX_THR_EVENT_INT_ST_S  29
    /* RMT_CH4_TX_THR_EVENT_INT_ST : RO ;bitpos:[28] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_TX_THR_EVENT_INT_ST  (BIT(28))
    #define RMT_CH4_TX_THR_EVENT_INT_ST_M  (BIT(28))
    #define RMT_CH4_TX_THR_EVENT_INT_ST_V  0x1
    #define RMT_CH4_TX_THR_EVENT_INT_ST_S  28
    /* RMT_CH3_TX_THR_EVENT_INT_ST : RO ;bitpos:[27] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_TX_THR_EVENT_INT_ST  (BIT(27))
    #define RMT_CH3_TX_THR_EVENT_INT_ST_M  (BIT(27))
    #define RMT_CH3_TX_THR_EVENT_INT_ST_V  0x1
    #define RMT_CH3_TX_THR_EVENT_INT_ST_S  27
    /* RMT_CH2_TX_THR_EVENT_INT_ST : RO ;bitpos:[26] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_TX_THR_EVENT_INT_ST  (BIT(26))
    #define RMT_CH2_TX_THR_EVENT_INT_ST_M  (BIT(26))
    #define RMT_CH2_TX_THR_EVENT_INT_ST_V  0x1
    #define RMT_CH2_TX_THR_EVENT_INT_ST_S  26
    /* RMT_CH1_TX_THR_EVENT_INT_ST : RO ;bitpos:[25] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_TX_THR_EVENT_INT_ST  (BIT(25))
    #define RMT_CH1_TX_THR_EVENT_INT_ST_M  (BIT(25))
    #define RMT_CH1_TX_THR_EVENT_INT_ST_V  0x1
    #define RMT_CH1_TX_THR_EVENT_INT_ST_S  25
    /* RMT_CH0_TX_THR_EVENT_INT_ST : RO ;bitpos:[24] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_TX_THR_EVENT_INT_ST  (BIT(24))
    #define RMT_CH0_TX_THR_EVENT_INT_ST_M  (BIT(24))
    #define RMT_CH0_TX_THR_EVENT_INT_ST_V  0x1
    #define RMT_CH0_TX_THR_EVENT_INT_ST_S  24
    /* RMT_CH7_ERR_INT_ST : RO ;bitpos:[23] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_ERR_INT_ST  (BIT(23))
    #define RMT_CH7_ERR_INT_ST_M  (BIT(23))
    #define RMT_CH7_ERR_INT_ST_V  0x1
    #define RMT_CH7_ERR_INT_ST_S  23
    /* RMT_CH7_RX_END_INT_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_RX_END_INT_ST  (BIT(22))
    #define RMT_CH7_RX_END_INT_ST_M  (BIT(22))
    #define RMT_CH7_RX_END_INT_ST_V  0x1
    #define RMT_CH7_RX_END_INT_ST_S  22
    /* RMT_CH7_TX_END_INT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_TX_END_INT_ST  (BIT(21))
    #define RMT_CH7_TX_END_INT_ST_M  (BIT(21))
    #define RMT_CH7_TX_END_INT_ST_V  0x1
    #define RMT_CH7_TX_END_INT_ST_S  21
    /* RMT_CH6_ERR_INT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_ERR_INT_ST  (BIT(20))
    #define RMT_CH6_ERR_INT_ST_M  (BIT(20))
    #define RMT_CH6_ERR_INT_ST_V  0x1
    #define RMT_CH6_ERR_INT_ST_S  20
    /* RMT_CH6_RX_END_INT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_RX_END_INT_ST  (BIT(19))
    #define RMT_CH6_RX_END_INT_ST_M  (BIT(19))
    #define RMT_CH6_RX_END_INT_ST_V  0x1
    #define RMT_CH6_RX_END_INT_ST_S  19
    /* RMT_CH6_TX_END_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_TX_END_INT_ST  (BIT(18))
    #define RMT_CH6_TX_END_INT_ST_M  (BIT(18))
    #define RMT_CH6_TX_END_INT_ST_V  0x1
    #define RMT_CH6_TX_END_INT_ST_S  18
    /* RMT_CH5_ERR_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_ERR_INT_ST  (BIT(17))
    #define RMT_CH5_ERR_INT_ST_M  (BIT(17))
    #define RMT_CH5_ERR_INT_ST_V  0x1
    #define RMT_CH5_ERR_INT_ST_S  17
    /* RMT_CH5_RX_END_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_RX_END_INT_ST  (BIT(16))
    #define RMT_CH5_RX_END_INT_ST_M  (BIT(16))
    #define RMT_CH5_RX_END_INT_ST_V  0x1
    #define RMT_CH5_RX_END_INT_ST_S  16
    /* RMT_CH5_TX_END_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_TX_END_INT_ST  (BIT(15))
    #define RMT_CH5_TX_END_INT_ST_M  (BIT(15))
    #define RMT_CH5_TX_END_INT_ST_V  0x1
    #define RMT_CH5_TX_END_INT_ST_S  15
    /* RMT_CH4_ERR_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_ERR_INT_ST  (BIT(14))
    #define RMT_CH4_ERR_INT_ST_M  (BIT(14))
    #define RMT_CH4_ERR_INT_ST_V  0x1
    #define RMT_CH4_ERR_INT_ST_S  14
    /* RMT_CH4_RX_END_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_RX_END_INT_ST  (BIT(13))
    #define RMT_CH4_RX_END_INT_ST_M  (BIT(13))
    #define RMT_CH4_RX_END_INT_ST_V  0x1
    #define RMT_CH4_RX_END_INT_ST_S  13
    /* RMT_CH4_TX_END_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_TX_END_INT_ST  (BIT(12))
    #define RMT_CH4_TX_END_INT_ST_M  (BIT(12))
    #define RMT_CH4_TX_END_INT_ST_V  0x1
    #define RMT_CH4_TX_END_INT_ST_S  12
    /* RMT_CH3_ERR_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_ERR_INT_ST  (BIT(11))
    #define RMT_CH3_ERR_INT_ST_M  (BIT(11))
    #define RMT_CH3_ERR_INT_ST_V  0x1
    #define RMT_CH3_ERR_INT_ST_S  11
    /* RMT_CH3_RX_END_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_RX_END_INT_ST  (BIT(10))
    #define RMT_CH3_RX_END_INT_ST_M  (BIT(10))
    #define RMT_CH3_RX_END_INT_ST_V  0x1
    #define RMT_CH3_RX_END_INT_ST_S  10
    /* RMT_CH3_TX_END_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_TX_END_INT_ST  (BIT(9))
    #define RMT_CH3_TX_END_INT_ST_M  (BIT(9))
    #define RMT_CH3_TX_END_INT_ST_V  0x1
    #define RMT_CH3_TX_END_INT_ST_S  9
    /* RMT_CH2_ERR_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_ERR_INT_ST  (BIT(8))
    #define RMT_CH2_ERR_INT_ST_M  (BIT(8))
    #define RMT_CH2_ERR_INT_ST_V  0x1
    #define RMT_CH2_ERR_INT_ST_S  8
    /* RMT_CH2_RX_END_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_RX_END_INT_ST  (BIT(7))
    #define RMT_CH2_RX_END_INT_ST_M  (BIT(7))
    #define RMT_CH2_RX_END_INT_ST_V  0x1
    #define RMT_CH2_RX_END_INT_ST_S  7
    /* RMT_CH2_TX_END_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_TX_END_INT_ST  (BIT(6))
    #define RMT_CH2_TX_END_INT_ST_M  (BIT(6))
    #define RMT_CH2_TX_END_INT_ST_V  0x1
    #define RMT_CH2_TX_END_INT_ST_S  6
    /* RMT_CH1_ERR_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_ERR_INT_ST  (BIT(5))
    #define RMT_CH1_ERR_INT_ST_M  (BIT(5))
    #define RMT_CH1_ERR_INT_ST_V  0x1
    #define RMT_CH1_ERR_INT_ST_S  5
    /* RMT_CH1_RX_END_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_RX_END_INT_ST  (BIT(4))
    #define RMT_CH1_RX_END_INT_ST_M  (BIT(4))
    #define RMT_CH1_RX_END_INT_ST_V  0x1
    #define RMT_CH1_RX_END_INT_ST_S  4
    /* RMT_CH1_TX_END_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_TX_END_INT_ST  (BIT(3))
    #define RMT_CH1_TX_END_INT_ST_M  (BIT(3))
    #define RMT_CH1_TX_END_INT_ST_V  0x1
    #define RMT_CH1_TX_END_INT_ST_S  3
    /* RMT_CH0_ERR_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_ERR_INT_ST  (BIT(2))
    #define RMT_CH0_ERR_INT_ST_M  (BIT(2))
    #define RMT_CH0_ERR_INT_ST_V  0x1
    #define RMT_CH0_ERR_INT_ST_S  2
    /* RMT_CH0_RX_END_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_RX_END_INT_ST  (BIT(1))
    #define RMT_CH0_RX_END_INT_ST_M  (BIT(1))
    #define RMT_CH0_RX_END_INT_ST_V  0x1
    #define RMT_CH0_RX_END_INT_ST_S  1
    /* RMT_CH0_TX_END_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_TX_END_INT_ST  (BIT(0))
    #define RMT_CH0_TX_END_INT_ST_M  (BIT(0))
    #define RMT_CH0_TX_END_INT_ST_V  0x1
    #define RMT_CH0_TX_END_INT_ST_S  0



#define RMT_INT_ENA_REG          (DR_REG_RMT_BASE + 0x00a8)
    /* RMT_CH7_TX_THR_EVENT_INT_ENA : R/W ;bitpos:[31] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_TX_THR_EVENT_INT_ENA  (BIT(31))
    #define RMT_CH7_TX_THR_EVENT_INT_ENA_M  (BIT(31))
    #define RMT_CH7_TX_THR_EVENT_INT_ENA_V  0x1
    #define RMT_CH7_TX_THR_EVENT_INT_ENA_S  31
    /* RMT_CH6_TX_THR_EVENT_INT_ENA : R/W ;bitpos:[30] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_TX_THR_EVENT_INT_ENA  (BIT(30))
    #define RMT_CH6_TX_THR_EVENT_INT_ENA_M  (BIT(30))
    #define RMT_CH6_TX_THR_EVENT_INT_ENA_V  0x1
    #define RMT_CH6_TX_THR_EVENT_INT_ENA_S  30
    /* RMT_CH5_TX_THR_EVENT_INT_ENA : R/W ;bitpos:[29] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_TX_THR_EVENT_INT_ENA  (BIT(29))
    #define RMT_CH5_TX_THR_EVENT_INT_ENA_M  (BIT(29))
    #define RMT_CH5_TX_THR_EVENT_INT_ENA_V  0x1
    #define RMT_CH5_TX_THR_EVENT_INT_ENA_S  29
    /* RMT_CH4_TX_THR_EVENT_INT_ENA : R/W ;bitpos:[28] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_TX_THR_EVENT_INT_ENA  (BIT(28))
    #define RMT_CH4_TX_THR_EVENT_INT_ENA_M  (BIT(28))
    #define RMT_CH4_TX_THR_EVENT_INT_ENA_V  0x1
    #define RMT_CH4_TX_THR_EVENT_INT_ENA_S  28
    /* RMT_CH3_TX_THR_EVENT_INT_ENA : R/W ;bitpos:[27] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_TX_THR_EVENT_INT_ENA  (BIT(27))
    #define RMT_CH3_TX_THR_EVENT_INT_ENA_M  (BIT(27))
    #define RMT_CH3_TX_THR_EVENT_INT_ENA_V  0x1
    #define RMT_CH3_TX_THR_EVENT_INT_ENA_S  27
    /* RMT_CH2_TX_THR_EVENT_INT_ENA : R/W ;bitpos:[26] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_TX_THR_EVENT_INT_ENA  (BIT(26))
    #define RMT_CH2_TX_THR_EVENT_INT_ENA_M  (BIT(26))
    #define RMT_CH2_TX_THR_EVENT_INT_ENA_V  0x1
    #define RMT_CH2_TX_THR_EVENT_INT_ENA_S  26
    /* RMT_CH1_TX_THR_EVENT_INT_ENA : R/W ;bitpos:[25] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_TX_THR_EVENT_INT_ENA  (BIT(25))
    #define RMT_CH1_TX_THR_EVENT_INT_ENA_M  (BIT(25))
    #define RMT_CH1_TX_THR_EVENT_INT_ENA_V  0x1
    #define RMT_CH1_TX_THR_EVENT_INT_ENA_S  25
    /* RMT_CH0_TX_THR_EVENT_INT_ENA : R/W ;bitpos:[24] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_TX_THR_EVENT_INT_ENA  (BIT(24))
    #define RMT_CH0_TX_THR_EVENT_INT_ENA_M  (BIT(24))
    #define RMT_CH0_TX_THR_EVENT_INT_ENA_V  0x1
    #define RMT_CH0_TX_THR_EVENT_INT_ENA_S  24
    /* RMT_CH7_ERR_INT_ENA : R/W ;bitpos:[23] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_ERR_INT_ENA  (BIT(23))
    #define RMT_CH7_ERR_INT_ENA_M  (BIT(23))
    #define RMT_CH7_ERR_INT_ENA_V  0x1
    #define RMT_CH7_ERR_INT_ENA_S  23
    /* RMT_CH7_RX_END_INT_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_RX_END_INT_ENA  (BIT(22))
    #define RMT_CH7_RX_END_INT_ENA_M  (BIT(22))
    #define RMT_CH7_RX_END_INT_ENA_V  0x1
    #define RMT_CH7_RX_END_INT_ENA_S  22
    /* RMT_CH7_TX_END_INT_ENA : R/W ;bitpos:[21] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_TX_END_INT_ENA  (BIT(21))
    #define RMT_CH7_TX_END_INT_ENA_M  (BIT(21))
    #define RMT_CH7_TX_END_INT_ENA_V  0x1
    #define RMT_CH7_TX_END_INT_ENA_S  21
    /* RMT_CH6_ERR_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_ERR_INT_ENA  (BIT(20))
    #define RMT_CH6_ERR_INT_ENA_M  (BIT(20))
    #define RMT_CH6_ERR_INT_ENA_V  0x1
    #define RMT_CH6_ERR_INT_ENA_S  20
    /* RMT_CH6_RX_END_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_RX_END_INT_ENA  (BIT(19))
    #define RMT_CH6_RX_END_INT_ENA_M  (BIT(19))
    #define RMT_CH6_RX_END_INT_ENA_V  0x1
    #define RMT_CH6_RX_END_INT_ENA_S  19
    /* RMT_CH6_TX_END_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_TX_END_INT_ENA  (BIT(18))
    #define RMT_CH6_TX_END_INT_ENA_M  (BIT(18))
    #define RMT_CH6_TX_END_INT_ENA_V  0x1
    #define RMT_CH6_TX_END_INT_ENA_S  18
    /* RMT_CH5_ERR_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_ERR_INT_ENA  (BIT(17))
    #define RMT_CH5_ERR_INT_ENA_M  (BIT(17))
    #define RMT_CH5_ERR_INT_ENA_V  0x1
    #define RMT_CH5_ERR_INT_ENA_S  17
    /* RMT_CH5_RX_END_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_RX_END_INT_ENA  (BIT(16))
    #define RMT_CH5_RX_END_INT_ENA_M  (BIT(16))
    #define RMT_CH5_RX_END_INT_ENA_V  0x1
    #define RMT_CH5_RX_END_INT_ENA_S  16
    /* RMT_CH5_TX_END_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_TX_END_INT_ENA  (BIT(15))
    #define RMT_CH5_TX_END_INT_ENA_M  (BIT(15))
    #define RMT_CH5_TX_END_INT_ENA_V  0x1
    #define RMT_CH5_TX_END_INT_ENA_S  15
    /* RMT_CH4_ERR_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_ERR_INT_ENA  (BIT(14))
    #define RMT_CH4_ERR_INT_ENA_M  (BIT(14))
    #define RMT_CH4_ERR_INT_ENA_V  0x1
    #define RMT_CH4_ERR_INT_ENA_S  14
    /* RMT_CH4_RX_END_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_RX_END_INT_ENA  (BIT(13))
    #define RMT_CH4_RX_END_INT_ENA_M  (BIT(13))
    #define RMT_CH4_RX_END_INT_ENA_V  0x1
    #define RMT_CH4_RX_END_INT_ENA_S  13
    /* RMT_CH4_TX_END_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_TX_END_INT_ENA  (BIT(12))
    #define RMT_CH4_TX_END_INT_ENA_M  (BIT(12))
    #define RMT_CH4_TX_END_INT_ENA_V  0x1
    #define RMT_CH4_TX_END_INT_ENA_S  12
    /* RMT_CH3_ERR_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_ERR_INT_ENA  (BIT(11))
    #define RMT_CH3_ERR_INT_ENA_M  (BIT(11))
    #define RMT_CH3_ERR_INT_ENA_V  0x1
    #define RMT_CH3_ERR_INT_ENA_S  11
    /* RMT_CH3_RX_END_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_RX_END_INT_ENA  (BIT(10))
    #define RMT_CH3_RX_END_INT_ENA_M  (BIT(10))
    #define RMT_CH3_RX_END_INT_ENA_V  0x1
    #define RMT_CH3_RX_END_INT_ENA_S  10
    /* RMT_CH3_TX_END_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_TX_END_INT_ENA  (BIT(9))
    #define RMT_CH3_TX_END_INT_ENA_M  (BIT(9))
    #define RMT_CH3_TX_END_INT_ENA_V  0x1
    #define RMT_CH3_TX_END_INT_ENA_S  9
    /* RMT_CH2_ERR_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_ERR_INT_ENA  (BIT(8))
    #define RMT_CH2_ERR_INT_ENA_M  (BIT(8))
    #define RMT_CH2_ERR_INT_ENA_V  0x1
    #define RMT_CH2_ERR_INT_ENA_S  8
    /* RMT_CH2_RX_END_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_RX_END_INT_ENA  (BIT(7))
    #define RMT_CH2_RX_END_INT_ENA_M  (BIT(7))
    #define RMT_CH2_RX_END_INT_ENA_V  0x1
    #define RMT_CH2_RX_END_INT_ENA_S  7
    /* RMT_CH2_TX_END_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_TX_END_INT_ENA  (BIT(6))
    #define RMT_CH2_TX_END_INT_ENA_M  (BIT(6))
    #define RMT_CH2_TX_END_INT_ENA_V  0x1
    #define RMT_CH2_TX_END_INT_ENA_S  6
    /* RMT_CH1_ERR_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_ERR_INT_ENA  (BIT(5))
    #define RMT_CH1_ERR_INT_ENA_M  (BIT(5))
    #define RMT_CH1_ERR_INT_ENA_V  0x1
    #define RMT_CH1_ERR_INT_ENA_S  5
    /* RMT_CH1_RX_END_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_RX_END_INT_ENA  (BIT(4))
    #define RMT_CH1_RX_END_INT_ENA_M  (BIT(4))
    #define RMT_CH1_RX_END_INT_ENA_V  0x1
    #define RMT_CH1_RX_END_INT_ENA_S  4
    /* RMT_CH1_TX_END_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_TX_END_INT_ENA  (BIT(3))
    #define RMT_CH1_TX_END_INT_ENA_M  (BIT(3))
    #define RMT_CH1_TX_END_INT_ENA_V  0x1
    #define RMT_CH1_TX_END_INT_ENA_S  3
    /* RMT_CH0_ERR_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_ERR_INT_ENA  (BIT(2))
    #define RMT_CH0_ERR_INT_ENA_M  (BIT(2))
    #define RMT_CH0_ERR_INT_ENA_V  0x1
    #define RMT_CH0_ERR_INT_ENA_S  2
    /* RMT_CH0_RX_END_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_RX_END_INT_ENA  (BIT(1))
    #define RMT_CH0_RX_END_INT_ENA_M  (BIT(1))
    #define RMT_CH0_RX_END_INT_ENA_V  0x1
    #define RMT_CH0_RX_END_INT_ENA_S  1
    /* RMT_CH0_TX_END_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_TX_END_INT_ENA  (BIT(0))
    #define RMT_CH0_TX_END_INT_ENA_M  (BIT(0))
    #define RMT_CH0_TX_END_INT_ENA_V  0x1
    #define RMT_CH0_TX_END_INT_ENA_S  0



