espressif/esp32-nesemu/components/driver/localinclude/soc/rmt_ctrl_reg.h
#define RMT_INT_CLR_REG          (DR_REG_RMT_BASE + 0x00ac)
    /* RMT_CH7_TX_THR_EVENT_INT_CLR : WO ;bitpos:[31] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_TX_THR_EVENT_INT_CLR  (BIT(31))
    #define RMT_CH7_TX_THR_EVENT_INT_CLR_M  (BIT(31))
    #define RMT_CH7_TX_THR_EVENT_INT_CLR_V  0x1
    #define RMT_CH7_TX_THR_EVENT_INT_CLR_S  31
    /* RMT_CH6_TX_THR_EVENT_INT_CLR : WO ;bitpos:[30] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_TX_THR_EVENT_INT_CLR  (BIT(30))
    #define RMT_CH6_TX_THR_EVENT_INT_CLR_M  (BIT(30))
    #define RMT_CH6_TX_THR_EVENT_INT_CLR_V  0x1
    #define RMT_CH6_TX_THR_EVENT_INT_CLR_S  30
    /* RMT_CH5_TX_THR_EVENT_INT_CLR : WO ;bitpos:[29] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_TX_THR_EVENT_INT_CLR  (BIT(29))
    #define RMT_CH5_TX_THR_EVENT_INT_CLR_M  (BIT(29))
    #define RMT_CH5_TX_THR_EVENT_INT_CLR_V  0x1
    #define RMT_CH5_TX_THR_EVENT_INT_CLR_S  29
    /* RMT_CH4_TX_THR_EVENT_INT_CLR : WO ;bitpos:[28] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_TX_THR_EVENT_INT_CLR  (BIT(28))
    #define RMT_CH4_TX_THR_EVENT_INT_CLR_M  (BIT(28))
    #define RMT_CH4_TX_THR_EVENT_INT_CLR_V  0x1
    #define RMT_CH4_TX_THR_EVENT_INT_CLR_S  28
    /* RMT_CH3_TX_THR_EVENT_INT_CLR : WO ;bitpos:[27] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_TX_THR_EVENT_INT_CLR  (BIT(27))
    #define RMT_CH3_TX_THR_EVENT_INT_CLR_M  (BIT(27))
    #define RMT_CH3_TX_THR_EVENT_INT_CLR_V  0x1
    #define RMT_CH3_TX_THR_EVENT_INT_CLR_S  27
    /* RMT_CH2_TX_THR_EVENT_INT_CLR : WO ;bitpos:[26] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_TX_THR_EVENT_INT_CLR  (BIT(26))
    #define RMT_CH2_TX_THR_EVENT_INT_CLR_M  (BIT(26))
    #define RMT_CH2_TX_THR_EVENT_INT_CLR_V  0x1
    #define RMT_CH2_TX_THR_EVENT_INT_CLR_S  26
    /* RMT_CH1_TX_THR_EVENT_INT_CLR : WO ;bitpos:[25] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_TX_THR_EVENT_INT_CLR  (BIT(25))
    #define RMT_CH1_TX_THR_EVENT_INT_CLR_M  (BIT(25))
    #define RMT_CH1_TX_THR_EVENT_INT_CLR_V  0x1
    #define RMT_CH1_TX_THR_EVENT_INT_CLR_S  25
    /* RMT_CH0_TX_THR_EVENT_INT_CLR : WO ;bitpos:[24] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_TX_THR_EVENT_INT_CLR  (BIT(24))
    #define RMT_CH0_TX_THR_EVENT_INT_CLR_M  (BIT(24))
    #define RMT_CH0_TX_THR_EVENT_INT_CLR_V  0x1
    #define RMT_CH0_TX_THR_EVENT_INT_CLR_S  24
    /* RMT_CH7_ERR_INT_CLR : WO ;bitpos:[23] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_ERR_INT_CLR  (BIT(23))
    #define RMT_CH7_ERR_INT_CLR_M  (BIT(23))
    #define RMT_CH7_ERR_INT_CLR_V  0x1
    #define RMT_CH7_ERR_INT_CLR_S  23
    /* RMT_CH7_RX_END_INT_CLR : WO ;bitpos:[22] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_RX_END_INT_CLR  (BIT(22))
    #define RMT_CH7_RX_END_INT_CLR_M  (BIT(22))
    #define RMT_CH7_RX_END_INT_CLR_V  0x1
    #define RMT_CH7_RX_END_INT_CLR_S  22
    /* RMT_CH7_TX_END_INT_CLR : WO ;bitpos:[21] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH7_TX_END_INT_CLR  (BIT(21))
    #define RMT_CH7_TX_END_INT_CLR_M  (BIT(21))
    #define RMT_CH7_TX_END_INT_CLR_V  0x1
    #define RMT_CH7_TX_END_INT_CLR_S  21
    /* RMT_CH6_ERR_INT_CLR : WO ;bitpos:[20] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_ERR_INT_CLR  (BIT(20))
    #define RMT_CH6_ERR_INT_CLR_M  (BIT(20))
    #define RMT_CH6_ERR_INT_CLR_V  0x1
    #define RMT_CH6_ERR_INT_CLR_S  20
    /* RMT_CH6_RX_END_INT_CLR : WO ;bitpos:[19] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_RX_END_INT_CLR  (BIT(19))
    #define RMT_CH6_RX_END_INT_CLR_M  (BIT(19))
    #define RMT_CH6_RX_END_INT_CLR_V  0x1
    #define RMT_CH6_RX_END_INT_CLR_S  19
    /* RMT_CH6_TX_END_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH6_TX_END_INT_CLR  (BIT(18))
    #define RMT_CH6_TX_END_INT_CLR_M  (BIT(18))
    #define RMT_CH6_TX_END_INT_CLR_V  0x1
    #define RMT_CH6_TX_END_INT_CLR_S  18
    /* RMT_CH5_ERR_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_ERR_INT_CLR  (BIT(17))
    #define RMT_CH5_ERR_INT_CLR_M  (BIT(17))
    #define RMT_CH5_ERR_INT_CLR_V  0x1
    #define RMT_CH5_ERR_INT_CLR_S  17
    /* RMT_CH5_RX_END_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_RX_END_INT_CLR  (BIT(16))
    #define RMT_CH5_RX_END_INT_CLR_M  (BIT(16))
    #define RMT_CH5_RX_END_INT_CLR_V  0x1
    #define RMT_CH5_RX_END_INT_CLR_S  16
    /* RMT_CH5_TX_END_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH5_TX_END_INT_CLR  (BIT(15))
    #define RMT_CH5_TX_END_INT_CLR_M  (BIT(15))
    #define RMT_CH5_TX_END_INT_CLR_V  0x1
    #define RMT_CH5_TX_END_INT_CLR_S  15
    /* RMT_CH4_ERR_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_ERR_INT_CLR  (BIT(14))
    #define RMT_CH4_ERR_INT_CLR_M  (BIT(14))
    #define RMT_CH4_ERR_INT_CLR_V  0x1
    #define RMT_CH4_ERR_INT_CLR_S  14
    /* RMT_CH4_RX_END_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_RX_END_INT_CLR  (BIT(13))
    #define RMT_CH4_RX_END_INT_CLR_M  (BIT(13))
    #define RMT_CH4_RX_END_INT_CLR_V  0x1
    #define RMT_CH4_RX_END_INT_CLR_S  13
    /* RMT_CH4_TX_END_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH4_TX_END_INT_CLR  (BIT(12))
    #define RMT_CH4_TX_END_INT_CLR_M  (BIT(12))
    #define RMT_CH4_TX_END_INT_CLR_V  0x1
    #define RMT_CH4_TX_END_INT_CLR_S  12
    /* RMT_CH3_ERR_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_ERR_INT_CLR  (BIT(11))
    #define RMT_CH3_ERR_INT_CLR_M  (BIT(11))
    #define RMT_CH3_ERR_INT_CLR_V  0x1
    #define RMT_CH3_ERR_INT_CLR_S  11
    /* RMT_CH3_RX_END_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_RX_END_INT_CLR  (BIT(10))
    #define RMT_CH3_RX_END_INT_CLR_M  (BIT(10))
    #define RMT_CH3_RX_END_INT_CLR_V  0x1
    #define RMT_CH3_RX_END_INT_CLR_S  10
    /* RMT_CH3_TX_END_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH3_TX_END_INT_CLR  (BIT(9))
    #define RMT_CH3_TX_END_INT_CLR_M  (BIT(9))
    #define RMT_CH3_TX_END_INT_CLR_V  0x1
    #define RMT_CH3_TX_END_INT_CLR_S  9
    /* RMT_CH2_ERR_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_ERR_INT_CLR  (BIT(8))
    #define RMT_CH2_ERR_INT_CLR_M  (BIT(8))
    #define RMT_CH2_ERR_INT_CLR_V  0x1
    #define RMT_CH2_ERR_INT_CLR_S  8
    /* RMT_CH2_RX_END_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_RX_END_INT_CLR  (BIT(7))
    #define RMT_CH2_RX_END_INT_CLR_M  (BIT(7))
    #define RMT_CH2_RX_END_INT_CLR_V  0x1
    #define RMT_CH2_RX_END_INT_CLR_S  7
    /* RMT_CH2_TX_END_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH2_TX_END_INT_CLR  (BIT(6))
    #define RMT_CH2_TX_END_INT_CLR_M  (BIT(6))
    #define RMT_CH2_TX_END_INT_CLR_V  0x1
    #define RMT_CH2_TX_END_INT_CLR_S  6
    /* RMT_CH1_ERR_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_ERR_INT_CLR  (BIT(5))
    #define RMT_CH1_ERR_INT_CLR_M  (BIT(5))
    #define RMT_CH1_ERR_INT_CLR_V  0x1
    #define RMT_CH1_ERR_INT_CLR_S  5
    /* RMT_CH1_RX_END_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_RX_END_INT_CLR  (BIT(4))
    #define RMT_CH1_RX_END_INT_CLR_M  (BIT(4))
    #define RMT_CH1_RX_END_INT_CLR_V  0x1
    #define RMT_CH1_RX_END_INT_CLR_S  4
    /* RMT_CH1_TX_END_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH1_TX_END_INT_CLR  (BIT(3))
    #define RMT_CH1_TX_END_INT_CLR_M  (BIT(3))
    #define RMT_CH1_TX_END_INT_CLR_V  0x1
    #define RMT_CH1_TX_END_INT_CLR_S  3
    /* RMT_CH0_ERR_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_ERR_INT_CLR  (BIT(2))
    #define RMT_CH0_ERR_INT_CLR_M  (BIT(2))
    #define RMT_CH0_ERR_INT_CLR_V  0x1
    #define RMT_CH0_ERR_INT_CLR_S  2
    /* RMT_CH0_RX_END_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_RX_END_INT_CLR  (BIT(1))
    #define RMT_CH0_RX_END_INT_CLR_M  (BIT(1))
    #define RMT_CH0_RX_END_INT_CLR_V  0x1
    #define RMT_CH0_RX_END_INT_CLR_S  1
    /* RMT_CH0_TX_END_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
    /*description: */
    #define RMT_CH0_TX_END_INT_CLR  (BIT(0))
    #define RMT_CH0_TX_END_INT_CLR_M  (BIT(0))
    #define RMT_CH0_TX_END_INT_CLR_V  0x1
    #define RMT_CH0_TX_END_INT_CLR_S  0



#define RMT_CH0CARRIER_DUTY_REG          (DR_REG_RMT_BASE + 0x00b0)
    /* RMT_CARRIER_HIGH_CH0 : R/W ;bitpos:[31:16] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_HIGH_CH0  0x0000FFFF
    #define RMT_CARRIER_HIGH_CH0_M  ((RMT_CARRIER_HIGH_CH0_V)<<(RMT_CARRIER_HIGH_CH0_S))
    #define RMT_CARRIER_HIGH_CH0_V  0xFFFF
    #define RMT_CARRIER_HIGH_CH0_S  16
    /* RMT_CARRIER_LOW_CH0 : R/W ;bitpos:[15:0] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_LOW_CH0  0x0000FFFF
    #define RMT_CARRIER_LOW_CH0_M  ((RMT_CARRIER_LOW_CH0_V)<<(RMT_CARRIER_LOW_CH0_S))
    #define RMT_CARRIER_LOW_CH0_V  0xFFFF
    #define RMT_CARRIER_LOW_CH0_S  0



#define RMT_CH1CARRIER_DUTY_REG          (DR_REG_RMT_BASE + 0x00b4)
    /* RMT_CARRIER_HIGH_CH1 : R/W ;bitpos:[31:16] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_HIGH_CH1  0x0000FFFF
    #define RMT_CARRIER_HIGH_CH1_M  ((RMT_CARRIER_HIGH_CH1_V)<<(RMT_CARRIER_HIGH_CH1_S))
    #define RMT_CARRIER_HIGH_CH1_V  0xFFFF
    #define RMT_CARRIER_HIGH_CH1_S  16
    /* RMT_CARRIER_LOW_CH1 : R/W ;bitpos:[15:0] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_LOW_CH1  0x0000FFFF
    #define RMT_CARRIER_LOW_CH1_M  ((RMT_CARRIER_LOW_CH1_V)<<(RMT_CARRIER_LOW_CH1_S))
    #define RMT_CARRIER_LOW_CH1_V  0xFFFF
    #define RMT_CARRIER_LOW_CH1_S  0



#define RMT_CH2CARRIER_DUTY_REG          (DR_REG_RMT_BASE + 0x00b8)
    /* RMT_CARRIER_HIGH_CH2 : R/W ;bitpos:[31:16] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_HIGH_CH2  0x0000FFFF
    #define RMT_CARRIER_HIGH_CH2_M  ((RMT_CARRIER_HIGH_CH2_V)<<(RMT_CARRIER_HIGH_CH2_S))
    #define RMT_CARRIER_HIGH_CH2_V  0xFFFF
    #define RMT_CARRIER_HIGH_CH2_S  16
    /* RMT_CARRIER_LOW_CH2 : R/W ;bitpos:[15:0] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_LOW_CH2  0x0000FFFF
    #define RMT_CARRIER_LOW_CH2_M  ((RMT_CARRIER_LOW_CH2_V)<<(RMT_CARRIER_LOW_CH2_S))
    #define RMT_CARRIER_LOW_CH2_V  0xFFFF
    #define RMT_CARRIER_LOW_CH2_S  0



#define RMT_CH3CARRIER_DUTY_REG          (DR_REG_RMT_BASE + 0x00bc)
    /* RMT_CARRIER_HIGH_CH3 : R/W ;bitpos:[31:16] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_HIGH_CH3  0x0000FFFF
    #define RMT_CARRIER_HIGH_CH3_M  ((RMT_CARRIER_HIGH_CH3_V)<<(RMT_CARRIER_HIGH_CH3_S))
    #define RMT_CARRIER_HIGH_CH3_V  0xFFFF
    #define RMT_CARRIER_HIGH_CH3_S  16
    /* RMT_CARRIER_LOW_CH3 : R/W ;bitpos:[15:0] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_LOW_CH3  0x0000FFFF
    #define RMT_CARRIER_LOW_CH3_M  ((RMT_CARRIER_LOW_CH3_V)<<(RMT_CARRIER_LOW_CH3_S))
    #define RMT_CARRIER_LOW_CH3_V  0xFFFF
    #define RMT_CARRIER_LOW_CH3_S  0



#define RMT_CH4CARRIER_DUTY_REG          (DR_REG_RMT_BASE + 0x00c0)
    /* RMT_CARRIER_HIGH_CH4 : R/W ;bitpos:[31:16] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_HIGH_CH4  0x0000FFFF
    #define RMT_CARRIER_HIGH_CH4_M  ((RMT_CARRIER_HIGH_CH4_V)<<(RMT_CARRIER_HIGH_CH4_S))
    #define RMT_CARRIER_HIGH_CH4_V  0xFFFF
    #define RMT_CARRIER_HIGH_CH4_S  16
    /* RMT_CARRIER_LOW_CH4 : R/W ;bitpos:[15:0] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_LOW_CH4  0x0000FFFF
    #define RMT_CARRIER_LOW_CH4_M  ((RMT_CARRIER_LOW_CH4_V)<<(RMT_CARRIER_LOW_CH4_S))
    #define RMT_CARRIER_LOW_CH4_V  0xFFFF
    #define RMT_CARRIER_LOW_CH4_S  0



