espressif/esp32-nesemu/components/driver/localinclude/soc/rmt_ctrl_reg.h
#define RMT_CH5CARRIER_DUTY_REG          (DR_REG_RMT_BASE + 0x00c4)
    /* RMT_CARRIER_HIGH_CH5 : R/W ;bitpos:[31:16] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_HIGH_CH5  0x0000FFFF
    #define RMT_CARRIER_HIGH_CH5_M  ((RMT_CARRIER_HIGH_CH5_V)<<(RMT_CARRIER_HIGH_CH5_S))
    #define RMT_CARRIER_HIGH_CH5_V  0xFFFF
    #define RMT_CARRIER_HIGH_CH5_S  16
    /* RMT_CARRIER_LOW_CH5 : R/W ;bitpos:[15:0] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_LOW_CH5  0x0000FFFF
    #define RMT_CARRIER_LOW_CH5_M  ((RMT_CARRIER_LOW_CH5_V)<<(RMT_CARRIER_LOW_CH5_S))
    #define RMT_CARRIER_LOW_CH5_V  0xFFFF
    #define RMT_CARRIER_LOW_CH5_S  0



#define RMT_CH6CARRIER_DUTY_REG          (DR_REG_RMT_BASE + 0x00c8)
    /* RMT_CARRIER_HIGH_CH6 : R/W ;bitpos:[31:16] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_HIGH_CH6  0x0000FFFF
    #define RMT_CARRIER_HIGH_CH6_M  ((RMT_CARRIER_HIGH_CH6_V)<<(RMT_CARRIER_HIGH_CH6_S))
    #define RMT_CARRIER_HIGH_CH6_V  0xFFFF
    #define RMT_CARRIER_HIGH_CH6_S  16
    /* RMT_CARRIER_LOW_CH6 : R/W ;bitpos:[15:0] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_LOW_CH6  0x0000FFFF
    #define RMT_CARRIER_LOW_CH6_M  ((RMT_CARRIER_LOW_CH6_V)<<(RMT_CARRIER_LOW_CH6_S))
    #define RMT_CARRIER_LOW_CH6_V  0xFFFF
    #define RMT_CARRIER_LOW_CH6_S  0



#define RMT_CH7CARRIER_DUTY_REG          (DR_REG_RMT_BASE + 0x00cc)
    /* RMT_CARRIER_HIGH_CH7 : R/W ;bitpos:[31:16] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_HIGH_CH7  0x0000FFFF
    #define RMT_CARRIER_HIGH_CH7_M  ((RMT_CARRIER_HIGH_CH7_V)<<(RMT_CARRIER_HIGH_CH7_S))
    #define RMT_CARRIER_HIGH_CH7_V  0xFFFF
    #define RMT_CARRIER_HIGH_CH7_S  16
    /* RMT_CARRIER_LOW_CH7 : R/W ;bitpos:[15:0] ;default: 16'h40 ; */
    /*description: */
    #define RMT_CARRIER_LOW_CH7  0x0000FFFF
    #define RMT_CARRIER_LOW_CH7_M  ((RMT_CARRIER_LOW_CH7_V)<<(RMT_CARRIER_LOW_CH7_S))
    #define RMT_CARRIER_LOW_CH7_V  0xFFFF
    #define RMT_CARRIER_LOW_CH7_S  0



#define RMT_CH0_TX_LIM_REG          (DR_REG_RMT_BASE + 0x00d0)
    /* RMT_TX_LIM_CH0 : R/W ;bitpos:[8:0] ;default: 9'h80 ; */
    /*description: */
    #define RMT_TX_LIM_CH0  0x000001FF
    #define RMT_TX_LIM_CH0_M  ((RMT_TX_LIM_CH0_V)<<(RMT_TX_LIM_CH0_S))
    #define RMT_TX_LIM_CH0_V  0x1FF
    #define RMT_TX_LIM_CH0_S  0



#define RMT_CH1_TX_LIM_REG          (DR_REG_RMT_BASE + 0x00d4)
    /* RMT_TX_LIM_CH1 : R/W ;bitpos:[8:0] ;default: 9'h80 ; */
    /*description: */
    #define RMT_TX_LIM_CH1  0x000001FF
    #define RMT_TX_LIM_CH1_M  ((RMT_TX_LIM_CH1_V)<<(RMT_TX_LIM_CH1_S))
    #define RMT_TX_LIM_CH1_V  0x1FF
    #define RMT_TX_LIM_CH1_S  0



#define RMT_CH2_TX_LIM_REG          (DR_REG_RMT_BASE + 0x00d8)
    /* RMT_TX_LIM_CH2 : R/W ;bitpos:[8:0] ;default: 9'h80 ; */
    /*description: */
    #define RMT_TX_LIM_CH2  0x000001FF
    #define RMT_TX_LIM_CH2_M  ((RMT_TX_LIM_CH2_V)<<(RMT_TX_LIM_CH2_S))
    #define RMT_TX_LIM_CH2_V  0x1FF
    #define RMT_TX_LIM_CH2_S  0



#define RMT_CH3_TX_LIM_REG          (DR_REG_RMT_BASE + 0x00dc)
    /* RMT_TX_LIM_CH3 : R/W ;bitpos:[8:0] ;default: 9'h80 ; */
    /*description: */
    #define RMT_TX_LIM_CH3  0x000001FF
    #define RMT_TX_LIM_CH3_M  ((RMT_TX_LIM_CH3_V)<<(RMT_TX_LIM_CH3_S))
    #define RMT_TX_LIM_CH3_V  0x1FF
    #define RMT_TX_LIM_CH3_S  0



#define RMT_CH4_TX_LIM_REG          (DR_REG_RMT_BASE + 0x00e0)
    /* RMT_TX_LIM_CH4 : R/W ;bitpos:[8:0] ;default: 9'h80 ; */
    /*description: */
    #define RMT_TX_LIM_CH4  0x000001FF
    #define RMT_TX_LIM_CH4_M  ((RMT_TX_LIM_CH4_V)<<(RMT_TX_LIM_CH4_S))
    #define RMT_TX_LIM_CH4_V  0x1FF
    #define RMT_TX_LIM_CH4_S  0



#define RMT_CH5_TX_LIM_REG          (DR_REG_RMT_BASE + 0x00e4)
    /* RMT_TX_LIM_CH5 : R/W ;bitpos:[8:0] ;default: 9'h80 ; */
    /*description: */
    #define RMT_TX_LIM_CH5  0x000001FF
    #define RMT_TX_LIM_CH5_M  ((RMT_TX_LIM_CH5_V)<<(RMT_TX_LIM_CH5_S))
    #define RMT_TX_LIM_CH5_V  0x1FF
    #define RMT_TX_LIM_CH5_S  0



#define RMT_CH6_TX_LIM_REG          (DR_REG_RMT_BASE + 0x00e8)
    /* RMT_TX_LIM_CH6 : R/W ;bitpos:[8:0] ;default: 9'h80 ; */
    /*description: */
    #define RMT_TX_LIM_CH6  0x000001FF
    #define RMT_TX_LIM_CH6_M  ((RMT_TX_LIM_CH6_V)<<(RMT_TX_LIM_CH6_S))
    #define RMT_TX_LIM_CH6_V  0x1FF
    #define RMT_TX_LIM_CH6_S  0



#define RMT_CH7_TX_LIM_REG          (DR_REG_RMT_BASE + 0x00ec)
    /* RMT_TX_LIM_CH7 : R/W ;bitpos:[8:0] ;default: 9'h80 ; */
    /*description: */
    #define RMT_TX_LIM_CH7  0x000001FF
    #define RMT_TX_LIM_CH7_M  ((RMT_TX_LIM_CH7_V)<<(RMT_TX_LIM_CH7_S))
    #define RMT_TX_LIM_CH7_V  0x1FF
    #define RMT_TX_LIM_CH7_S  0



#define RMT_APB_CONF_REG          (DR_REG_RMT_BASE + 0x00f0)
    /* RMT_MEM_TX_WRAP_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
    /*description: */
    #define RMT_MEM_TX_WRAP_EN  (BIT(1))
    #define RMT_MEM_TX_WRAP_EN_M  (BIT(1))
    #define RMT_MEM_TX_WRAP_EN_V  0x1
    #define RMT_MEM_TX_WRAP_EN_S  1
    /* RMT_APB_FIFO_MASK : R/W ;bitpos:[0] ;default: 1'h0 ; */
    /*description: */
    #define RMT_APB_FIFO_MASK  (BIT(0))
    #define RMT_APB_FIFO_MASK_M  (BIT(0))
    #define RMT_APB_FIFO_MASK_V  0x1
    #define RMT_APB_FIFO_MASK_S  0



#define RMT_DATE_REG          (DR_REG_RMT_BASE + 0x00fc)
    /* RMT_DATE : R/W ;bitpos:[31:0] ;default: 32'h16022600 ; */
    /*description: */
    #define RMT_DATE  0xFFFFFFFF
    #define RMT_DATE_M  ((RMT_DATE_V)<<(RMT_DATE_S))
    #define RMT_DATE_V  0xFFFFFFFF
    #define RMT_DATE_S  0






#endif /* _DRIVER_RMT_CTRL_REG_H_ */



